doc/exper_v2.org
* WMTs

SETTINGS: P_\theta_t [1 times] No significant difference

|--------------------------------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------|
| file name                      | bleu1 | bleu2 | bleu3 | bleu4 |  bs-p |  bs-r |  bs-f |  rl-p |  rl-r |  rl-f |
|--------------------------------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------|
| cs-en-5121LoRD-VI___period512/ | 0.566 | 0.432 |  0.34 | 0.271 | 0.875 | 0.944 | 0.908 | 0.541 | 0.573 | 0.554 |
| cs-en-5121vanilla___finally/   | 0.567 | 0.433 | 0.341 | 0.272 | 0.876 | 0.946 |  0.91 | 0.542 | 0.586 |  0.56 |
| cs-en-2561LoRD-VI___period256/ | 0.572 | 0.439 | 0.345 | 0.274 | 0.876 | 0.946 | 0.909 | 0.551 | 0.588 | 0.566 |
| cs-en-2561vanilla___finally/   | 0.572 | 0.439 | 0.346 | 0.277 | 0.876 | 0.946 | 0.909 |  0.55 | 0.588 | 0.565 |
| cs-en-1281LoRD-VI___period128/ | 0.562 | 0.429 | 0.337 | 0.269 | 0.875 | 0.944 | 0.908 | 0.543 | 0.579 | 0.557 |
| cs-en-1281vanilla___finally/   | 0.557 | 0.422 | 0.331 | 0.263 | 0.874 | 0.944 | 0.907 | 0.532 | 0.569 | 0.547 |
| cs-en-641LoRD-VI___period64/   | 0.552 | 0.417 | 0.327 |  0.26 | 0.874 | 0.942 | 0.907 | 0.531 | 0.565 | 0.544 |
| cs-en-641vanilla___finally/    | 0.553 | 0.418 | 0.326 | 0.258 | 0.874 | 0.943 | 0.907 | 0.527 | 0.566 | 0.543 |
|--------------------------------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------|
| de-en-5121LoRD-VI___period512/ | 0.611 | 0.487 | 0.397 | 0.328 | 0.886 | 0.953 | 0.918 | 0.589 | 0.628 | 0.604 |
| de-en-5121vanilla___finally/   | 0.607 | 0.482 | 0.392 | 0.324 | 0.886 | 0.954 | 0.919 | 0.585 | 0.628 | 0.603 |
| de-en-2561LoRD-VI___period256/ | 0.609 | 0.484 | 0.394 | 0.324 | 0.886 | 0.954 | 0.919 | 0.592 | 0.633 | 0.609 |
| de-en-2561vanilla___finally/   | 0.605 | 0.483 | 0.394 | 0.325 | 0.885 | 0.954 | 0.918 | 0.586 |  0.63 | 0.604 |
| de-en-1281LoRD-VI___period128/ | 0.613 | 0.489 | 0.398 | 0.328 | 0.885 | 0.953 | 0.918 | 0.591 | 0.627 | 0.606 |
| de-en-1281vanilla___finally/   | 0.602 |  0.48 | 0.392 | 0.325 | 0.886 | 0.954 | 0.919 | 0.586 | 0.636 | 0.607 |
| de-en-641LoRD-VI___period64/   | 0.609 | 0.486 | 0.397 | 0.328 | 0.885 | 0.953 | 0.918 | 0.586 | 0.627 | 0.603 |
| de-en-641vanilla___finally/    |   0.6 | 0.477 | 0.389 | 0.323 | 0.885 | 0.952 | 0.917 |  0.58 | 0.626 |   0.6 |
|--------------------------------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------|
| fi-en-5121LoRD-VI___period512/ | 0.521 | 0.376 | 0.283 | 0.217 | 0.875 | 0.941 | 0.907 | 0.504 | 0.516 | 0.507 |
| fi-en-5121vanilla___finally/   | 0.515 | 0.372 |  0.28 | 0.214 | 0.875 | 0.941 | 0.907 | 0.498 | 0.532 | 0.511 |
| fi-en-2561LoRD-VI___period256/ | 0.528 | 0.381 | 0.287 | 0.221 | 0.875 | 0.941 | 0.907 | 0.513 | 0.524 | 0.515 |
| fi-en-2561vanilla___finally/   | 0.515 |  0.37 | 0.276 | 0.209 | 0.875 | 0.942 | 0.907 | 0.495 |  0.53 | 0.509 |
| fi-en-1281LoRD-VI___period128/ | 0.515 | 0.369 | 0.275 | 0.208 | 0.874 |  0.94 | 0.906 | 0.504 |  0.53 | 0.514 |
| fi-en-1281vanilla___finally/   | 0.512 | 0.364 |  0.27 | 0.204 | 0.875 |  0.94 | 0.906 | 0.491 | 0.522 | 0.503 |
| fi-en-641LoRD-VI___period64/   | 0.515 | 0.368 | 0.275 | 0.208 | 0.874 | 0.939 | 0.905 | 0.497 | 0.521 | 0.506 |
| fi-en-641vanilla___finally/    | 0.507 | 0.362 |  0.27 | 0.205 | 0.874 | 0.941 | 0.906 | 0.488 | 0.523 | 0.502 |
|--------------------------------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------|


SETTINGS: DELTA [5 times] WORSE

|------------------------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------|
| fname                        |          b1 |          b2 |          b3 |          b4 |         bsp |         bsr |         bsf |         rlp |         rlr |         rlf |
|------------------------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------|
| de-en645LoRD-VI___period64   | 0.604-0.003 | 0.481-0.002 | 0.391-0.002 | 0.322-0.002 | 0.884-0.001 | 0.951-0.001 | 0.916-0.001 | 0.582-0.004 | 0.606-0.014 | 0.591-0.008 |
| de-en645vanilla___finally    | 0.597-0.012 | 0.473-0.011 |  0.384-0.01 | 0.316-0.009 | 0.884-0.001 | 0.952-0.001 | 0.917-0.001 | 0.579-0.004 | 0.623-0.004 | 0.597-0.004 |
| de-en1285LoRD-VI___period128 | 0.612-0.002 |  0.49-0.002 |   0.4-0.003 | 0.331-0.003 |   0.886-0.0 |   0.954-0.0 |   0.918-0.0 | 0.589-0.001 | 0.629-0.005 | 0.606-0.003 |
| de-en1285vanilla___finally   | 0.608-0.003 | 0.485-0.004 | 0.396-0.005 | 0.328-0.005 |   0.886-0.0 |   0.954-0.0 |   0.918-0.0 | 0.586-0.004 | 0.631-0.004 | 0.605-0.004 |
| de-en2565LoRD-VI___period256 | 0.614-0.003 | 0.492-0.003 | 0.402-0.003 | 0.332-0.003 |   0.886-0.0 |   0.954-0.0 |   0.919-0.0 | 0.593-0.001 | 0.631-0.002 | 0.609-0.001 |
| de-en2565vanilla___finally   | 0.614-0.004 |  0.49-0.005 |   0.4-0.006 | 0.332-0.007 |   0.886-0.0 |   0.954-0.0 |   0.918-0.0 | 0.592-0.004 | 0.632-0.003 | 0.609-0.004 |
|------------------------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------|
| fi-en645LoRD-VI___period64   | 0.511-0.002 | 0.364-0.001 | 0.271-0.002 | 0.205-0.003 |   0.873-0.0 | 0.939-0.001 |   0.905-0.0 | 0.496-0.002 | 0.512-0.007 | 0.501-0.003 |
| fi-en645vanilla___finally    | 0.509-0.005 | 0.363-0.004 | 0.271-0.004 | 0.205-0.003 | 0.874-0.001 |  0.94-0.001 | 0.906-0.001 | 0.489-0.006 | 0.521-0.004 | 0.501-0.005 |
| fi-en1285LoRD-VI___period128 | 0.513-0.005 | 0.369-0.005 | 0.275-0.005 | 0.208-0.004 |   0.875-0.0 |  0.94-0.001 |   0.906-0.0 | 0.498-0.005 | 0.524-0.006 | 0.508-0.004 |
| fi-en1285vanilla___finally   | 0.514-0.005 | 0.369-0.005 | 0.275-0.006 | 0.208-0.006 | 0.875-0.001 | 0.941-0.001 | 0.906-0.001 | 0.496-0.005 | 0.529-0.004 | 0.508-0.005 |
| fi-en2565LoRD-VI___period256 | 0.519-0.003 | 0.373-0.004 | 0.279-0.004 | 0.211-0.005 |   0.875-0.0 | 0.941-0.001 |   0.907-0.0 | 0.502-0.003 |  0.522-0.01 | 0.508-0.005 |
| fi-en2565vanilla___finally   | 0.515-0.002 |  0.37-0.002 | 0.277-0.002 |  0.21-0.002 |   0.875-0.0 | 0.942-0.001 |   0.907-0.0 | 0.498-0.001 | 0.532-0.002 | 0.511-0.001 |
|------------------------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------|

Stable method now: No significant difference

|-------------------------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------|
| fname                         |          b1 |          b2 |          b3 |          b4 |         bsp |         bsr |         bsf |         rlp |         rlr |         rlf |
|-------------------------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------|
| cs-en--645LoRD-VI___period64  |  0.56-0.006 | 0.425-0.005 | 0.334-0.005 | 0.266-0.005 | 0.874-0.001 | 0.943-0.001 | 0.907-0.001 | 0.538-0.004 | 0.571-0.004 | 0.551-0.004 |
| cs-en--645LoRD-VI___period512 | 0.553-0.005 |  0.42-0.005 | 0.329-0.004 | 0.262-0.004 | 0.874-0.001 | 0.943-0.001 | 0.907-0.001 |  0.53-0.004 | 0.576-0.005 | 0.549-0.004 |
|-------------------------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------|
| de-en--645LoRD-VI___period64  | 0.601-0.013 | 0.477-0.012 |  0.387-0.01 | 0.319-0.009 | 0.882-0.003 | 0.949-0.002 | 0.914-0.003 | 0.582-0.006 | 0.595-0.006 | 0.584-0.003 |
| de-en--645LoRD-VI___period512 | 0.598-0.004 | 0.474-0.004 | 0.384-0.004 | 0.316-0.004 | 0.885-0.001 | 0.953-0.001 | 0.918-0.001 | 0.579-0.004 | 0.629-0.003 |   0.6-0.004 |
| de-en645vanilla___finally     | 0.597-0.012 | 0.473-0.011 |  0.384-0.01 | 0.316-0.009 | 0.884-0.001 | 0.952-0.001 | 0.917-0.001 | 0.579-0.004 | 0.623-0.004 | 0.597-0.004 |
|-------------------------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------|
| fi-en--645LoRD-VI___period64  |  0.51-0.005 | 0.364-0.006 | 0.271-0.006 | 0.204-0.006 | 0.873-0.001 | 0.939-0.001 | 0.905-0.001 | 0.495-0.006 | 0.516-0.009 | 0.502-0.008 |
| fi-en--645LoRD-VI___period512 | 0.504-0.008 | 0.359-0.006 | 0.268-0.006 | 0.203-0.005 | 0.874-0.001 | 0.941-0.001 | 0.906-0.001 | 0.485-0.005 | 0.522-0.004 |   0.5-0.004 |
| fi-en645vanilla___finally     | 0.509-0.005 | 0.363-0.004 | 0.271-0.004 | 0.205-0.003 | 0.874-0.001 |  0.94-0.001 | 0.906-0.001 | 0.489-0.006 | 0.521-0.004 | 0.501-0.005 |
|-------------------------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------|


|------------------------------------------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------|
| Hyper-para experiments                         |             |             |             |             |             |             |             |             |             |             |
|------------------------------------------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------|
| fname                                          | b1          | b2          | b3          | b4          | bsp         | bsr         | bsf         | rlp         | rlr         | rlf         |
|------------------------------------------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------|
|------------------------------------------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------|
| cs-en--TAU104TAU210cs-en641LoRD-VI___period512 | 0.557-nan   | 0.423-nan   | 0.331-nan   | 0.263-nan   | 0.874-nan   | 0.944-nan   | 0.908-nan   | 0.535-nan   | 0.578-nan   | 0.552-nan   |
| cs-en--TAU105TAU210cs-en641LoRD-VI___period512 | 0.558-nan   | 0.425-nan   | 0.334-nan   | 0.266-nan   | 0.875-nan   | 0.944-nan   | 0.908-nan   | 0.537-nan   | 0.578-nan   | 0.554-nan   |
| cs-en--TAU106TAU210cs-en641LoRD-VI___period512 | 0.553-nan   | 0.42-nan    | 0.331-nan   | 0.264-nan   | 0.873-nan   | 0.943-nan   | 0.906-nan   | 0.529-nan   | 0.571-nan   | 0.546-nan   |
| cs-enTAU1070TAU210cs-en645LoRD-VI___period512  | 0.557-0.002 | 0.423-0.003 | 0.333-0.003 | 0.265-0.003 | 0.875-0.0   | 0.944-0.001 | 0.908-0.0   | 0.533-0.004 | 0.579-0.003 | 0.552-0.003 |
| cs-enTAU1075TAU210cs-en645LoRD-VI___period512  | 0.559-0.003 | 0.426-0.004 | 0.335-0.004 | 0.267-0.005 | 0.875-0.001 | 0.944-0.001 | 0.908-0.001 | 0.536-0.002 | 0.578-0.003 | 0.553-0.003 |
| cs-enTAU1080TAU210cs-en645LoRD-VI___period512  | 0.558-0.005 | 0.424-0.005 | 0.333-0.006 | 0.265-0.006 | 0.875-0.0   | 0.944-0.001 | 0.908-0.001 | 0.534-0.007 | 0.579-0.005 | 0.552-0.006 |
| cs-enTAU1085TAU210cs-en645LoRD-VI___period512  | 0.558-0.008 | 0.423-0.009 | 0.332-0.009 | 0.264-0.008 | 0.874-0.0   | 0.944-0.001 | 0.907-0.001 | 0.534-0.006 | 0.575-0.005 | 0.551-0.005 |
| cs-enTAU1090TAU210cs-en645LoRD-VI___period512  | 0.557-0.003 | 0.423-0.004 | 0.333-0.004 | 0.266-0.004 | 0.875-0.001 | 0.944-0.001 | 0.908-0.001 | 0.534-0.005 | 0.579-0.006 | 0.553-0.005 |
| cs-enTAU1095TAU210cs-en645LoRD-VI___period512  | 0.557-0.003 | 0.422-0.003 | 0.331-0.003 | 0.264-0.003 | 0.875-0.0   | 0.944-0.001 | 0.908-0.001 | 0.533-0.002 | 0.577-0.004 | 0.551-0.003 |
| cs-enTAU110TAU210cs-en645LoRD-VI___period512   | 0.557-0.003 | 0.423-0.005 | 0.332-0.005 | 0.264-0.005 | 0.875-0.001 | 0.944-0.001 | 0.908-0.001 | 0.534-0.004 | 0.576-0.005 | 0.551-0.004 |
|------------------------------------------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------|
| Tau1=0.75, tau2=0.8 to 0.95                    |             |             |             |             |             |             |             |             |             |             |
| TAU1075TAU2080cs-en641LoRD-VI___period512      | 0.551-nan   | 0.417-nan   | 0.327-nan   | 0.259-nan   | 0.874-nan   | 0.942-nan   | 0.906-nan   | 0.524-nan   | 0.568-nan   | 0.542-nan   |
| TAU1075TAU2085cs-en641LoRD-VI___period512      | 0.547-nan   | 0.415-nan   | 0.325-nan   | 0.258-nan   | 0.875-nan   | 0.944-nan   | 0.908-nan   | 0.526-nan   | 0.576-nan   | 0.547-nan   |
| TAU1075TAU2090cs-en641LoRD-VI___period512      | 0.556-nan   | 0.422-nan   | 0.331-nan   | 0.263-nan   | 0.875-nan   | 0.944-nan   | 0.908-nan   | 0.535-nan   | 0.58-nan    | 0.554-nan   |
| TAU1075TAU2095cs-en641LoRD-VI___period512      | 0.553-nan   | 0.42-nan    | 0.332-nan   | 0.266-nan   | 0.874-nan   | 0.943-nan   | 0.907-nan   | 0.531-nan   | 0.571-nan   | 0.547-nan   |
|------------------------------------------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------+-------------|

