doc/exper_v2.html
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4c9d743">1. WMTs</a></li>
<li><a href="#orgcd03d3f">2. QAs</a></li>
<li><a href="#org2043cec">3. D2T</a></li>
<li><a href="#orgb74620b">4. Summarization</a></li>
<li><a href="#org2559276">5. General Train</a>
<ul>
<li><a href="#orgb8adddb">5.1. Shorttext</a></li>
<li><a href="#orgdbf5c22">5.2. Longtext</a></li>
<li><a href="#org066d739">5.3. Continuing Pre-training</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org4c9d743" class="outline-2">
<h2 id="org4c9d743"><span class="section-number-2">1.</span> WMTs</h2>
<div class="outline-text-2" id="text-1">
<p>
SETTINGS: P_&theta;_t [1 times] No significant difference
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">file name</th>
<th scope="col" class="org-right">bleu1</th>
<th scope="col" class="org-right">bleu2</th>
<th scope="col" class="org-right">bleu3</th>
<th scope="col" class="org-right">bleu4</th>
<th scope="col" class="org-right">bs-p</th>
<th scope="col" class="org-right">bs-r</th>
<th scope="col" class="org-right">bs-f</th>
<th scope="col" class="org-right">rl-p</th>
<th scope="col" class="org-right">rl-r</th>
<th scope="col" class="org-right">rl-f</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">cs-en-5121LoRD-VI___period512/</td>
<td class="org-right">0.566</td>
<td class="org-right">0.432</td>
<td class="org-right">0.34</td>
<td class="org-right">0.271</td>
<td class="org-right">0.875</td>
<td class="org-right">0.944</td>
<td class="org-right">0.908</td>
<td class="org-right">0.541</td>
<td class="org-right">0.573</td>
<td class="org-right">0.554</td>
</tr>

<tr>
<td class="org-left">cs-en-5121vanilla___finally/</td>
<td class="org-right">0.567</td>
<td class="org-right">0.433</td>
<td class="org-right">0.341</td>
<td class="org-right">0.272</td>
<td class="org-right">0.876</td>
<td class="org-right">0.946</td>
<td class="org-right">0.91</td>
<td class="org-right">0.542</td>
<td class="org-right">0.586</td>
<td class="org-right">0.56</td>
</tr>

<tr>
<td class="org-left">cs-en-2561LoRD-VI___period256/</td>
<td class="org-right">0.572</td>
<td class="org-right">0.439</td>
<td class="org-right">0.345</td>
<td class="org-right">0.274</td>
<td class="org-right">0.876</td>
<td class="org-right">0.946</td>
<td class="org-right">0.909</td>
<td class="org-right">0.551</td>
<td class="org-right">0.588</td>
<td class="org-right">0.566</td>
</tr>

<tr>
<td class="org-left">cs-en-2561vanilla___finally/</td>
<td class="org-right">0.572</td>
<td class="org-right">0.439</td>
<td class="org-right">0.346</td>
<td class="org-right">0.277</td>
<td class="org-right">0.876</td>
<td class="org-right">0.946</td>
<td class="org-right">0.909</td>
<td class="org-right">0.55</td>
<td class="org-right">0.588</td>
<td class="org-right">0.565</td>
</tr>

<tr>
<td class="org-left">cs-en-1281LoRD-VI___period128/</td>
<td class="org-right">0.562</td>
<td class="org-right">0.429</td>
<td class="org-right">0.337</td>
<td class="org-right">0.269</td>
<td class="org-right">0.875</td>
<td class="org-right">0.944</td>
<td class="org-right">0.908</td>
<td class="org-right">0.543</td>
<td class="org-right">0.579</td>
<td class="org-right">0.557</td>
</tr>

<tr>
<td class="org-left">cs-en-1281vanilla___finally/</td>
<td class="org-right">0.557</td>
<td class="org-right">0.422</td>
<td class="org-right">0.331</td>
<td class="org-right">0.263</td>
<td class="org-right">0.874</td>
<td class="org-right">0.944</td>
<td class="org-right">0.907</td>
<td class="org-right">0.532</td>
<td class="org-right">0.569</td>
<td class="org-right">0.547</td>
</tr>

<tr>
<td class="org-left">cs-en-641LoRD-VI___period64/</td>
<td class="org-right">0.552</td>
<td class="org-right">0.417</td>
<td class="org-right">0.327</td>
<td class="org-right">0.26</td>
<td class="org-right">0.874</td>
<td class="org-right">0.942</td>
<td class="org-right">0.907</td>
<td class="org-right">0.531</td>
<td class="org-right">0.565</td>
<td class="org-right">0.544</td>
</tr>

<tr>
<td class="org-left">cs-en-641vanilla___finally/</td>
<td class="org-right">0.553</td>
<td class="org-right">0.418</td>
<td class="org-right">0.326</td>
<td class="org-right">0.258</td>
<td class="org-right">0.874</td>
<td class="org-right">0.943</td>
<td class="org-right">0.907</td>
<td class="org-right">0.527</td>
<td class="org-right">0.566</td>
<td class="org-right">0.543</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">de-en-5121LoRD-VI___period512/</td>
<td class="org-right">0.611</td>
<td class="org-right">0.487</td>
<td class="org-right">0.397</td>
<td class="org-right">0.328</td>
<td class="org-right">0.886</td>
<td class="org-right">0.953</td>
<td class="org-right">0.918</td>
<td class="org-right">0.589</td>
<td class="org-right">0.628</td>
<td class="org-right">0.604</td>
</tr>

<tr>
<td class="org-left">de-en-5121vanilla___finally/</td>
<td class="org-right">0.607</td>
<td class="org-right">0.482</td>
<td class="org-right">0.392</td>
<td class="org-right">0.324</td>
<td class="org-right">0.886</td>
<td class="org-right">0.954</td>
<td class="org-right">0.919</td>
<td class="org-right">0.585</td>
<td class="org-right">0.628</td>
<td class="org-right">0.603</td>
</tr>

<tr>
<td class="org-left">de-en-2561LoRD-VI___period256/</td>
<td class="org-right">0.609</td>
<td class="org-right">0.484</td>
<td class="org-right">0.394</td>
<td class="org-right">0.324</td>
<td class="org-right">0.886</td>
<td class="org-right">0.954</td>
<td class="org-right">0.919</td>
<td class="org-right">0.592</td>
<td class="org-right">0.633</td>
<td class="org-right">0.609</td>
</tr>

<tr>
<td class="org-left">de-en-2561vanilla___finally/</td>
<td class="org-right">0.605</td>
<td class="org-right">0.483</td>
<td class="org-right">0.394</td>
<td class="org-right">0.325</td>
<td class="org-right">0.885</td>
<td class="org-right">0.954</td>
<td class="org-right">0.918</td>
<td class="org-right">0.586</td>
<td class="org-right">0.63</td>
<td class="org-right">0.604</td>
</tr>

<tr>
<td class="org-left">de-en-1281LoRD-VI___period128/</td>
<td class="org-right">0.613</td>
<td class="org-right">0.489</td>
<td class="org-right">0.398</td>
<td class="org-right">0.328</td>
<td class="org-right">0.885</td>
<td class="org-right">0.953</td>
<td class="org-right">0.918</td>
<td class="org-right">0.591</td>
<td class="org-right">0.627</td>
<td class="org-right">0.606</td>
</tr>

<tr>
<td class="org-left">de-en-1281vanilla___finally/</td>
<td class="org-right">0.602</td>
<td class="org-right">0.48</td>
<td class="org-right">0.392</td>
<td class="org-right">0.325</td>
<td class="org-right">0.886</td>
<td class="org-right">0.954</td>
<td class="org-right">0.919</td>
<td class="org-right">0.586</td>
<td class="org-right">0.636</td>
<td class="org-right">0.607</td>
</tr>

<tr>
<td class="org-left">de-en-641LoRD-VI___period64/</td>
<td class="org-right">0.609</td>
<td class="org-right">0.486</td>
<td class="org-right">0.397</td>
<td class="org-right">0.328</td>
<td class="org-right">0.885</td>
<td class="org-right">0.953</td>
<td class="org-right">0.918</td>
<td class="org-right">0.586</td>
<td class="org-right">0.627</td>
<td class="org-right">0.603</td>
</tr>

<tr>
<td class="org-left">de-en-641vanilla___finally/</td>
<td class="org-right">0.6</td>
<td class="org-right">0.477</td>
<td class="org-right">0.389</td>
<td class="org-right">0.323</td>
<td class="org-right">0.885</td>
<td class="org-right">0.952</td>
<td class="org-right">0.917</td>
<td class="org-right">0.58</td>
<td class="org-right">0.626</td>
<td class="org-right">0.6</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">fi-en-5121LoRD-VI___period512/</td>
<td class="org-right">0.521</td>
<td class="org-right">0.376</td>
<td class="org-right">0.283</td>
<td class="org-right">0.217</td>
<td class="org-right">0.875</td>
<td class="org-right">0.941</td>
<td class="org-right">0.907</td>
<td class="org-right">0.504</td>
<td class="org-right">0.516</td>
<td class="org-right">0.507</td>
</tr>

<tr>
<td class="org-left">fi-en-5121vanilla___finally/</td>
<td class="org-right">0.515</td>
<td class="org-right">0.372</td>
<td class="org-right">0.28</td>
<td class="org-right">0.214</td>
<td class="org-right">0.875</td>
<td class="org-right">0.941</td>
<td class="org-right">0.907</td>
<td class="org-right">0.498</td>
<td class="org-right">0.532</td>
<td class="org-right">0.511</td>
</tr>

<tr>
<td class="org-left">fi-en-2561LoRD-VI___period256/</td>
<td class="org-right">0.528</td>
<td class="org-right">0.381</td>
<td class="org-right">0.287</td>
<td class="org-right">0.221</td>
<td class="org-right">0.875</td>
<td class="org-right">0.941</td>
<td class="org-right">0.907</td>
<td class="org-right">0.513</td>
<td class="org-right">0.524</td>
<td class="org-right">0.515</td>
</tr>

<tr>
<td class="org-left">fi-en-2561vanilla___finally/</td>
<td class="org-right">0.515</td>
<td class="org-right">0.37</td>
<td class="org-right">0.276</td>
<td class="org-right">0.209</td>
<td class="org-right">0.875</td>
<td class="org-right">0.942</td>
<td class="org-right">0.907</td>
<td class="org-right">0.495</td>
<td class="org-right">0.53</td>
<td class="org-right">0.509</td>
</tr>

<tr>
<td class="org-left">fi-en-1281LoRD-VI___period128/</td>
<td class="org-right">0.515</td>
<td class="org-right">0.369</td>
<td class="org-right">0.275</td>
<td class="org-right">0.208</td>
<td class="org-right">0.874</td>
<td class="org-right">0.94</td>
<td class="org-right">0.906</td>
<td class="org-right">0.504</td>
<td class="org-right">0.53</td>
<td class="org-right">0.514</td>
</tr>

<tr>
<td class="org-left">fi-en-1281vanilla___finally/</td>
<td class="org-right">0.512</td>
<td class="org-right">0.364</td>
<td class="org-right">0.27</td>
<td class="org-right">0.204</td>
<td class="org-right">0.875</td>
<td class="org-right">0.94</td>
<td class="org-right">0.906</td>
<td class="org-right">0.491</td>
<td class="org-right">0.522</td>
<td class="org-right">0.503</td>
</tr>

<tr>
<td class="org-left">fi-en-641LoRD-VI___period64/</td>
<td class="org-right">0.515</td>
<td class="org-right">0.368</td>
<td class="org-right">0.275</td>
<td class="org-right">0.208</td>
<td class="org-right">0.874</td>
<td class="org-right">0.939</td>
<td class="org-right">0.905</td>
<td class="org-right">0.497</td>
<td class="org-right">0.521</td>
<td class="org-right">0.506</td>
</tr>

<tr>
<td class="org-left">fi-en-641vanilla___finally/</td>
<td class="org-right">0.507</td>
<td class="org-right">0.362</td>
<td class="org-right">0.27</td>
<td class="org-right">0.205</td>
<td class="org-right">0.874</td>
<td class="org-right">0.941</td>
<td class="org-right">0.906</td>
<td class="org-right">0.488</td>
<td class="org-right">0.523</td>
<td class="org-right">0.502</td>
</tr>
</tbody>
</table>


<p>
SETTINGS: DELTA [5 times] WORSE
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">fname</th>
<th scope="col" class="org-right">b1</th>
<th scope="col" class="org-right">b2</th>
<th scope="col" class="org-right">b3</th>
<th scope="col" class="org-right">b4</th>
<th scope="col" class="org-right">bsp</th>
<th scope="col" class="org-right">bsr</th>
<th scope="col" class="org-right">bsf</th>
<th scope="col" class="org-right">rlp</th>
<th scope="col" class="org-right">rlr</th>
<th scope="col" class="org-right">rlf</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">de-en645LoRD-VI___period64</td>
<td class="org-right">0.604-0.003</td>
<td class="org-right">0.481-0.002</td>
<td class="org-right">0.391-0.002</td>
<td class="org-right">0.322-0.002</td>
<td class="org-right">0.884-0.001</td>
<td class="org-right">0.951-0.001</td>
<td class="org-right">0.916-0.001</td>
<td class="org-right">0.582-0.004</td>
<td class="org-right">0.606-0.014</td>
<td class="org-right">0.591-0.008</td>
</tr>

<tr>
<td class="org-left">de-en645vanilla___finally</td>
<td class="org-right">0.597-0.012</td>
<td class="org-right">0.473-0.011</td>
<td class="org-right">0.384-0.01</td>
<td class="org-right">0.316-0.009</td>
<td class="org-right">0.884-0.001</td>
<td class="org-right">0.952-0.001</td>
<td class="org-right">0.917-0.001</td>
<td class="org-right">0.579-0.004</td>
<td class="org-right">0.623-0.004</td>
<td class="org-right">0.597-0.004</td>
</tr>

<tr>
<td class="org-left">de-en1285LoRD-VI___period128</td>
<td class="org-right">0.612-0.002</td>
<td class="org-right">0.49-0.002</td>
<td class="org-right">0.4-0.003</td>
<td class="org-right">0.331-0.003</td>
<td class="org-right">0.886-0.0</td>
<td class="org-right">0.954-0.0</td>
<td class="org-right">0.918-0.0</td>
<td class="org-right">0.589-0.001</td>
<td class="org-right">0.629-0.005</td>
<td class="org-right">0.606-0.003</td>
</tr>

<tr>
<td class="org-left">de-en1285vanilla___finally</td>
<td class="org-right">0.608-0.003</td>
<td class="org-right">0.485-0.004</td>
<td class="org-right">0.396-0.005</td>
<td class="org-right">0.328-0.005</td>
<td class="org-right">0.886-0.0</td>
<td class="org-right">0.954-0.0</td>
<td class="org-right">0.918-0.0</td>
<td class="org-right">0.586-0.004</td>
<td class="org-right">0.631-0.004</td>
<td class="org-right">0.605-0.004</td>
</tr>

<tr>
<td class="org-left">de-en2565LoRD-VI___period256</td>
<td class="org-right">0.614-0.003</td>
<td class="org-right">0.492-0.003</td>
<td class="org-right">0.402-0.003</td>
<td class="org-right">0.332-0.003</td>
<td class="org-right">0.886-0.0</td>
<td class="org-right">0.954-0.0</td>
<td class="org-right">0.919-0.0</td>
<td class="org-right">0.593-0.001</td>
<td class="org-right">0.631-0.002</td>
<td class="org-right">0.609-0.001</td>
</tr>

<tr>
<td class="org-left">de-en2565vanilla___finally</td>
<td class="org-right">0.614-0.004</td>
<td class="org-right">0.49-0.005</td>
<td class="org-right">0.4-0.006</td>
<td class="org-right">0.332-0.007</td>
<td class="org-right">0.886-0.0</td>
<td class="org-right">0.954-0.0</td>
<td class="org-right">0.918-0.0</td>
<td class="org-right">0.592-0.004</td>
<td class="org-right">0.632-0.003</td>
<td class="org-right">0.609-0.004</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">fi-en645LoRD-VI___period64</td>
<td class="org-right">0.511-0.002</td>
<td class="org-right">0.364-0.001</td>
<td class="org-right">0.271-0.002</td>
<td class="org-right">0.205-0.003</td>
<td class="org-right">0.873-0.0</td>
<td class="org-right">0.939-0.001</td>
<td class="org-right">0.905-0.0</td>
<td class="org-right">0.496-0.002</td>
<td class="org-right">0.512-0.007</td>
<td class="org-right">0.501-0.003</td>
</tr>

<tr>
<td class="org-left">fi-en645vanilla___finally</td>
<td class="org-right">0.509-0.005</td>
<td class="org-right">0.363-0.004</td>
<td class="org-right">0.271-0.004</td>
<td class="org-right">0.205-0.003</td>
<td class="org-right">0.874-0.001</td>
<td class="org-right">0.94-0.001</td>
<td class="org-right">0.906-0.001</td>
<td class="org-right">0.489-0.006</td>
<td class="org-right">0.521-0.004</td>
<td class="org-right">0.501-0.005</td>
</tr>

<tr>
<td class="org-left">fi-en1285LoRD-VI___period128</td>
<td class="org-right">0.513-0.005</td>
<td class="org-right">0.369-0.005</td>
<td class="org-right">0.275-0.005</td>
<td class="org-right">0.208-0.004</td>
<td class="org-right">0.875-0.0</td>
<td class="org-right">0.94-0.001</td>
<td class="org-right">0.906-0.0</td>
<td class="org-right">0.498-0.005</td>
<td class="org-right">0.524-0.006</td>
<td class="org-right">0.508-0.004</td>
</tr>

<tr>
<td class="org-left">fi-en1285vanilla___finally</td>
<td class="org-right">0.514-0.005</td>
<td class="org-right">0.369-0.005</td>
<td class="org-right">0.275-0.006</td>
<td class="org-right">0.208-0.006</td>
<td class="org-right">0.875-0.001</td>
<td class="org-right">0.941-0.001</td>
<td class="org-right">0.906-0.001</td>
<td class="org-right">0.496-0.005</td>
<td class="org-right">0.529-0.004</td>
<td class="org-right">0.508-0.005</td>
</tr>

<tr>
<td class="org-left">fi-en2565LoRD-VI___period256</td>
<td class="org-right">0.519-0.003</td>
<td class="org-right">0.373-0.004</td>
<td class="org-right">0.279-0.004</td>
<td class="org-right">0.211-0.005</td>
<td class="org-right">0.875-0.0</td>
<td class="org-right">0.941-0.001</td>
<td class="org-right">0.907-0.0</td>
<td class="org-right">0.502-0.003</td>
<td class="org-right">0.522-0.01</td>
<td class="org-right">0.508-0.005</td>
</tr>

<tr>
<td class="org-left">fi-en2565vanilla___finally</td>
<td class="org-right">0.515-0.002</td>
<td class="org-right">0.37-0.002</td>
<td class="org-right">0.277-0.002</td>
<td class="org-right">0.21-0.002</td>
<td class="org-right">0.875-0.0</td>
<td class="org-right">0.942-0.001</td>
<td class="org-right">0.907-0.0</td>
<td class="org-right">0.498-0.001</td>
<td class="org-right">0.532-0.002</td>
<td class="org-right">0.511-0.001</td>
</tr>
</tbody>
</table>

<p>
Stable method now: No significant difference
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">fname</th>
<th scope="col" class="org-right">b1</th>
<th scope="col" class="org-right">b2</th>
<th scope="col" class="org-right">b3</th>
<th scope="col" class="org-right">b4</th>
<th scope="col" class="org-right">bsp</th>
<th scope="col" class="org-right">bsr</th>
<th scope="col" class="org-right">bsf</th>
<th scope="col" class="org-right">rlp</th>
<th scope="col" class="org-right">rlr</th>
<th scope="col" class="org-right">rlf</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">cs-en&#x2013;645LoRD-VI___period64</td>
<td class="org-right">0.56-0.006</td>
<td class="org-right">0.425-0.005</td>
<td class="org-right">0.334-0.005</td>
<td class="org-right">0.266-0.005</td>
<td class="org-right">0.874-0.001</td>
<td class="org-right">0.943-0.001</td>
<td class="org-right">0.907-0.001</td>
<td class="org-right">0.538-0.004</td>
<td class="org-right">0.571-0.004</td>
<td class="org-right">0.551-0.004</td>
</tr>

<tr>
<td class="org-left">cs-en&#x2013;645LoRD-VI___period512</td>
<td class="org-right">0.553-0.005</td>
<td class="org-right">0.42-0.005</td>
<td class="org-right">0.329-0.004</td>
<td class="org-right">0.262-0.004</td>
<td class="org-right">0.874-0.001</td>
<td class="org-right">0.943-0.001</td>
<td class="org-right">0.907-0.001</td>
<td class="org-right">0.53-0.004</td>
<td class="org-right">0.576-0.005</td>
<td class="org-right">0.549-0.004</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">de-en&#x2013;645LoRD-VI___period64</td>
<td class="org-right">0.601-0.013</td>
<td class="org-right">0.477-0.012</td>
<td class="org-right">0.387-0.01</td>
<td class="org-right">0.319-0.009</td>
<td class="org-right">0.882-0.003</td>
<td class="org-right">0.949-0.002</td>
<td class="org-right">0.914-0.003</td>
<td class="org-right">0.582-0.006</td>
<td class="org-right">0.595-0.006</td>
<td class="org-right">0.584-0.003</td>
</tr>

<tr>
<td class="org-left">de-en&#x2013;645LoRD-VI___period512</td>
<td class="org-right">0.598-0.004</td>
<td class="org-right">0.474-0.004</td>
<td class="org-right">0.384-0.004</td>
<td class="org-right">0.316-0.004</td>
<td class="org-right">0.885-0.001</td>
<td class="org-right">0.953-0.001</td>
<td class="org-right">0.918-0.001</td>
<td class="org-right">0.579-0.004</td>
<td class="org-right">0.629-0.003</td>
<td class="org-right">0.6-0.004</td>
</tr>

<tr>
<td class="org-left">de-en645vanilla___finally</td>
<td class="org-right">0.597-0.012</td>
<td class="org-right">0.473-0.011</td>
<td class="org-right">0.384-0.01</td>
<td class="org-right">0.316-0.009</td>
<td class="org-right">0.884-0.001</td>
<td class="org-right">0.952-0.001</td>
<td class="org-right">0.917-0.001</td>
<td class="org-right">0.579-0.004</td>
<td class="org-right">0.623-0.004</td>
<td class="org-right">0.597-0.004</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">fi-en&#x2013;645LoRD-VI___period64</td>
<td class="org-right">0.51-0.005</td>
<td class="org-right">0.364-0.006</td>
<td class="org-right">0.271-0.006</td>
<td class="org-right">0.204-0.006</td>
<td class="org-right">0.873-0.001</td>
<td class="org-right">0.939-0.001</td>
<td class="org-right">0.905-0.001</td>
<td class="org-right">0.495-0.006</td>
<td class="org-right">0.516-0.009</td>
<td class="org-right">0.502-0.008</td>
</tr>

<tr>
<td class="org-left">fi-en&#x2013;645LoRD-VI___period512</td>
<td class="org-right">0.504-0.008</td>
<td class="org-right">0.359-0.006</td>
<td class="org-right">0.268-0.006</td>
<td class="org-right">0.203-0.005</td>
<td class="org-right">0.874-0.001</td>
<td class="org-right">0.941-0.001</td>
<td class="org-right">0.906-0.001</td>
<td class="org-right">0.485-0.005</td>
<td class="org-right">0.522-0.004</td>
<td class="org-right">0.5-0.004</td>
</tr>

<tr>
<td class="org-left">fi-en645vanilla___finally</td>
<td class="org-right">0.509-0.005</td>
<td class="org-right">0.363-0.004</td>
<td class="org-right">0.271-0.004</td>
<td class="org-right">0.205-0.003</td>
<td class="org-right">0.874-0.001</td>
<td class="org-right">0.94-0.001</td>
<td class="org-right">0.906-0.001</td>
<td class="org-right">0.489-0.006</td>
<td class="org-right">0.521-0.004</td>
<td class="org-right">0.501-0.005</td>
</tr>
</tbody>
</table>


<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Hyper-para experiments</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">fname</td>
<td class="org-left">b1</td>
<td class="org-left">b2</td>
<td class="org-left">b3</td>
<td class="org-left">b4</td>
<td class="org-left">bsp</td>
<td class="org-left">bsr</td>
<td class="org-left">bsf</td>
<td class="org-left">rlp</td>
<td class="org-left">rlr</td>
<td class="org-left">rlf</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">cs-en&#x2013;TAU104TAU210cs-en641LoRD-VI___period512</td>
<td class="org-left">0.557-nan</td>
<td class="org-left">0.423-nan</td>
<td class="org-left">0.331-nan</td>
<td class="org-left">0.263-nan</td>
<td class="org-left">0.874-nan</td>
<td class="org-left">0.944-nan</td>
<td class="org-left">0.908-nan</td>
<td class="org-left">0.535-nan</td>
<td class="org-left">0.578-nan</td>
<td class="org-left">0.552-nan</td>
</tr>

<tr>
<td class="org-left">cs-en&#x2013;TAU105TAU210cs-en641LoRD-VI___period512</td>
<td class="org-left">0.558-nan</td>
<td class="org-left">0.425-nan</td>
<td class="org-left">0.334-nan</td>
<td class="org-left">0.266-nan</td>
<td class="org-left">0.875-nan</td>
<td class="org-left">0.944-nan</td>
<td class="org-left">0.908-nan</td>
<td class="org-left">0.537-nan</td>
<td class="org-left">0.578-nan</td>
<td class="org-left">0.554-nan</td>
</tr>

<tr>
<td class="org-left">cs-en&#x2013;TAU106TAU210cs-en641LoRD-VI___period512</td>
<td class="org-left">0.553-nan</td>
<td class="org-left">0.42-nan</td>
<td class="org-left">0.331-nan</td>
<td class="org-left">0.264-nan</td>
<td class="org-left">0.873-nan</td>
<td class="org-left">0.943-nan</td>
<td class="org-left">0.906-nan</td>
<td class="org-left">0.529-nan</td>
<td class="org-left">0.571-nan</td>
<td class="org-left">0.546-nan</td>
</tr>

<tr>
<td class="org-left">cs-enTAU1070TAU210cs-en645LoRD-VI___period512</td>
<td class="org-left">0.557-0.002</td>
<td class="org-left">0.423-0.003</td>
<td class="org-left">0.333-0.003</td>
<td class="org-left">0.265-0.003</td>
<td class="org-left">0.875-0.0</td>
<td class="org-left">0.944-0.001</td>
<td class="org-left">0.908-0.0</td>
<td class="org-left">0.533-0.004</td>
<td class="org-left">0.579-0.003</td>
<td class="org-left">0.552-0.003</td>
</tr>

<tr>
<td class="org-left">cs-enTAU1075TAU210cs-en645LoRD-VI___period512</td>
<td class="org-left">0.559-0.003</td>
<td class="org-left">0.426-0.004</td>
<td class="org-left">0.335-0.004</td>
<td class="org-left">0.267-0.005</td>
<td class="org-left">0.875-0.001</td>
<td class="org-left">0.944-0.001</td>
<td class="org-left">0.908-0.001</td>
<td class="org-left">0.536-0.002</td>
<td class="org-left">0.578-0.003</td>
<td class="org-left">0.553-0.003</td>
</tr>

<tr>
<td class="org-left">cs-enTAU1080TAU210cs-en645LoRD-VI___period512</td>
<td class="org-left">0.558-0.005</td>
<td class="org-left">0.424-0.005</td>
<td class="org-left">0.333-0.006</td>
<td class="org-left">0.265-0.006</td>
<td class="org-left">0.875-0.0</td>
<td class="org-left">0.944-0.001</td>
<td class="org-left">0.908-0.001</td>
<td class="org-left">0.534-0.007</td>
<td class="org-left">0.579-0.005</td>
<td class="org-left">0.552-0.006</td>
</tr>

<tr>
<td class="org-left">cs-enTAU1085TAU210cs-en645LoRD-VI___period512</td>
<td class="org-left">0.558-0.008</td>
<td class="org-left">0.423-0.009</td>
<td class="org-left">0.332-0.009</td>
<td class="org-left">0.264-0.008</td>
<td class="org-left">0.874-0.0</td>
<td class="org-left">0.944-0.001</td>
<td class="org-left">0.907-0.001</td>
<td class="org-left">0.534-0.006</td>
<td class="org-left">0.575-0.005</td>
<td class="org-left">0.551-0.005</td>
</tr>

<tr>
<td class="org-left">cs-enTAU1090TAU210cs-en645LoRD-VI___period512</td>
<td class="org-left">0.557-0.003</td>
<td class="org-left">0.423-0.004</td>
<td class="org-left">0.333-0.004</td>
<td class="org-left">0.266-0.004</td>
<td class="org-left">0.875-0.001</td>
<td class="org-left">0.944-0.001</td>
<td class="org-left">0.908-0.001</td>
<td class="org-left">0.534-0.005</td>
<td class="org-left">0.579-0.006</td>
<td class="org-left">0.553-0.005</td>
</tr>

<tr>
<td class="org-left">cs-enTAU1095TAU210cs-en645LoRD-VI___period512</td>
<td class="org-left">0.557-0.003</td>
<td class="org-left">0.422-0.003</td>
<td class="org-left">0.331-0.003</td>
<td class="org-left">0.264-0.003</td>
<td class="org-left">0.875-0.0</td>
<td class="org-left">0.944-0.001</td>
<td class="org-left">0.908-0.001</td>
<td class="org-left">0.533-0.002</td>
<td class="org-left">0.577-0.004</td>
<td class="org-left">0.551-0.003</td>
</tr>

<tr>
<td class="org-left">cs-enTAU110TAU210cs-en645LoRD-VI___period512</td>
<td class="org-left">0.557-0.003</td>
<td class="org-left">0.423-0.005</td>
<td class="org-left">0.332-0.005</td>
<td class="org-left">0.264-0.005</td>
<td class="org-left">0.875-0.001</td>
<td class="org-left">0.944-0.001</td>
<td class="org-left">0.908-0.001</td>
<td class="org-left">0.534-0.004</td>
<td class="org-left">0.576-0.005</td>
<td class="org-left">0.551-0.004</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Tau1=0.75, tau2=0.8 to 0.95</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TAU1075TAU2080cs-en641LoRD-VI___period512</td>
<td class="org-left">0.551-nan</td>
<td class="org-left">0.417-nan</td>
<td class="org-left">0.327-nan</td>
<td class="org-left">0.259-nan</td>
<td class="org-left">0.874-nan</td>
<td class="org-left">0.942-nan</td>
<td class="org-left">0.906-nan</td>
<td class="org-left">0.524-nan</td>
<td class="org-left">0.568-nan</td>
<td class="org-left">0.542-nan</td>
</tr>

<tr>
<td class="org-left">TAU1075TAU2085cs-en641LoRD-VI___period512</td>
<td class="org-left">0.547-nan</td>
<td class="org-left">0.415-nan</td>
<td class="org-left">0.325-nan</td>
<td class="org-left">0.258-nan</td>
<td class="org-left">0.875-nan</td>
<td class="org-left">0.944-nan</td>
<td class="org-left">0.908-nan</td>
<td class="org-left">0.526-nan</td>
<td class="org-left">0.576-nan</td>
<td class="org-left">0.547-nan</td>
</tr>

<tr>
<td class="org-left">TAU1075TAU2090cs-en641LoRD-VI___period512</td>
<td class="org-left">0.556-nan</td>
<td class="org-left">0.422-nan</td>
<td class="org-left">0.331-nan</td>
<td class="org-left">0.263-nan</td>
<td class="org-left">0.875-nan</td>
<td class="org-left">0.944-nan</td>
<td class="org-left">0.908-nan</td>
<td class="org-left">0.535-nan</td>
<td class="org-left">0.58-nan</td>
<td class="org-left">0.554-nan</td>
</tr>

<tr>
<td class="org-left">TAU1075TAU2095cs-en641LoRD-VI___period512</td>
<td class="org-left">0.553-nan</td>
<td class="org-left">0.42-nan</td>
<td class="org-left">0.332-nan</td>
<td class="org-left">0.266-nan</td>
<td class="org-left">0.874-nan</td>
<td class="org-left">0.943-nan</td>
<td class="org-left">0.907-nan</td>
<td class="org-left">0.531-nan</td>
<td class="org-left">0.571-nan</td>
<td class="org-left">0.547-nan</td>
</tr>
</tbody>
</table>
</div>
</div>
