doc/exper_v2.org
* QAs

SETTINGS: P_\theta_t  [1 times] NSD

|-------------------------------------------------------------------------------+-------+-------+-------+-------|
| fname                                                                         |   acc |     p |     r |    f1 |
|-------------------------------------------------------------------------------+-------+-------+-------+-------|
| piqa-----./qa_ckpts/QAAAnewpiqa5121LoRD-VI___period512/                       | 0.766 | 0.797 | 0.765 | 0.759 |
| piqa-----./qa_ckpts/QAAAnewpiqa5121vanilla___finally/                         | 0.796 | 0.811 | 0.796 | 0.793 |
| piqa-----./qa_ckpts/QAAAnewpiqa2561LoRD-VI___period256/                       | 0.784 | 0.788 | 0.784 | 0.783 |
| piqa-----./qa_ckpts/QAAAnewpiqa2561vanilla___finally/                         | 0.776 | 0.788 | 0.776 | 0.774 |
| piqa-----./qa_ckpts/QAAAnewpiqa1281LoRD-VI___period128/                       | 0.768 | 0.791 | 0.767 | 0.763 |
| piqa-----./qa_ckpts/QAAAnewpiqa1281vanilla___finally/                         | 0.788 | 0.807 | 0.788 | 0.784 |
| piqa-----./qa_ckpts/QAAAnewpiqa641LoRD-VI___period64/                         |  0.67 | 0.756 | 0.671 | 0.641 |
| piqa-----./qa_ckpts/QAAAnewpiqa641vanilla___finally/                          | 0.728 | 0.755 | 0.727 |  0.72 |
|-------------------------------------------------------------------------------+-------+-------+-------+-------|
| truthful_qa-----./qa_ckpts/QAAAnewtruthful_qa5121LoRD-VI___period512/         | 0.324 |   0.5 | 0.162 | 0.245 |
| truthful_qa-----./qa_ckpts/QAAAnewtruthful_qa5121vanilla___finally/           | 0.472 |   0.5 | 0.236 | 0.321 |
| truthful_qa-----./qa_ckpts/QAAAnewtruthful_qa2561LoRD-VI___period256/         | 0.198 |   0.5 | 0.099 | 0.165 |
| truthful_qa-----./qa_ckpts/QAAAnewtruthful_qa2561vanilla___finally/           | 0.365 |   0.5 | 0.182 | 0.267 |
| truthful_qa-----./qa_ckpts/QAAAnewtruthful_qa1281LoRD-VI___period128/         | 0.569 |   0.5 | 0.285 | 0.363 |
| truthful_qa-----./qa_ckpts/QAAAnewtruthful_qa1281vanilla___finally/           |  0.45 |   0.5 | 0.225 | 0.311 |
| truthful_qa-----./qa_ckpts/QAAAnewtruthful_qa641LoRD-VI___period64/           |  0.25 |   0.5 | 0.125 |   0.2 |
| truthful_qa-----./qa_ckpts/QAAAnewtruthful_qa641vanilla___finally/            | 0.436 |   0.5 | 0.218 | 0.303 |
|-------------------------------------------------------------------------------+-------+-------+-------+-------|
| allenai/ai2_arc-----./qa_ckpts/QAAAnewallenai/ai2_arc5121LoRD-VI___period512/ | 0.288 | 0.456 | 0.209 | 0.105 |
| allenai/ai2_arc-----./qa_ckpts/QAAAnewallenai/ai2_arc5121vanilla___finally/   | 0.278 | 0.238 | 0.202 | 0.102 |
| allenai/ai2_arc-----./qa_ckpts/QAAAnewallenai/ai2_arc2561LoRD-VI___period256/ | 0.281 | 0.322 | 0.205 | 0.108 |
| allenai/ai2_arc-----./qa_ckpts/QAAAnewallenai/ai2_arc2561vanilla___finally/   | 0.288 | 0.389 | 0.209 |  0.11 |
| allenai/ai2_arc-----./qa_ckpts/QAAAnewallenai/ai2_arc1281LoRD-VI___period128/ | 0.284 | 0.289 | 0.207 | 0.104 |
| allenai/ai2_arc-----./qa_ckpts/QAAAnewallenai/ai2_arc1281vanilla___finally/   | 0.278 | 0.288 | 0.202 | 0.107 |
| allenai/ai2_arc-----./qa_ckpts/QAAAnewallenai/ai2_arc641LoRD-VI___period64/   | 0.284 | 0.156 | 0.206 |   0.1 |
| allenai/ai2_arc-----./qa_ckpts/QAAAnewallenai/ai2_arc641vanilla___finally/    | 0.278 | 0.254 | 0.202 | 0.107 |
|-------------------------------------------------------------------------------+-------+-------+-------+-------|


SETTINGS: DELTA [5 times] hard to say

|-----------------------------------------+-------------+-------------+-------------+-------------|
| fname                                   |         acc |           p |           r |          f1 |
|-----------------------------------------+-------------+-------------+-------------+-------------|
| piqa--64LoRD-VI___period512             | 0.769-0.011 | 0.779-0.014 | 0.769-0.011 | 0.767-0.011 |
| piqa--64vanilla___finally               |  0.76-0.021 | 0.771-0.007 |  0.76-0.021 | 0.757-0.025 |
| piqa--128LoRD-VI___period512            | 0.749-0.032 | 0.764-0.014 | 0.748-0.032 | 0.744-0.039 |
| piqa--128vanilla___finally              | 0.774-0.022 |  0.784-0.02 | 0.774-0.022 | 0.771-0.023 |
| piqa--256LoRD-VI___period512            | 0.789-0.021 | 0.791-0.022 | 0.789-0.021 | 0.788-0.021 |
| piqa--256vanilla___finally              | 0.782-0.005 | 0.788-0.004 | 0.782-0.006 | 0.781-0.007 |
| piqa--512LoRD-VI___period512            | 0.772-0.044 | 0.799-0.014 | 0.771-0.045 | 0.765-0.054 |
| piqa--512vanilla___finally              | 0.788-0.023 | 0.798-0.017 | 0.787-0.023 | 0.785-0.024 |
|-----------------------------------------+-------------+-------------+-------------+-------------|
| truthful_qa--64LoRD-VI___period512      | 0.451-0.055 |     0.5-0.0 | 0.226-0.027 |  0.31-0.026 |
| truthful_qa--64vanilla___finally        | 0.381-0.173 |     0.5-0.0 |  0.19-0.087 | 0.266-0.093 |
| truthful_qa--128LoRD-VI___period512     | 0.432-0.052 |     0.5-0.0 | 0.216-0.026 | 0.301-0.026 |
| truthful_qa--128vanilla___finally       | 0.454-0.069 |     0.5-0.0 | 0.227-0.034 | 0.311-0.034 |
| truthful_qa--256LoRD-VI___period512     | 0.363-0.094 |     0.5-0.0 | 0.181-0.047 | 0.263-0.054 |
| truthful_qa--256vanilla___finally       | 0.446-0.053 |     0.5-0.0 | 0.223-0.026 | 0.308-0.026 |
| truthful_qa--512LoRD-VI___period512     | 0.357-0.132 |     0.5-0.0 | 0.179-0.066 | 0.257-0.076 |
| truthful_qa--512vanilla___finally       | 0.426-0.037 |     0.5-0.0 | 0.213-0.018 | 0.299-0.018 |
|-----------------------------------------+-------------+-------------+-------------+-------------|
| allenai/ai2_arc--64LoRD-VI___period512  | 0.288-0.003 |  0.39-0.116 |  0.21-0.002 | 0.106-0.005 |
| allenai/ai2_arc--64vanilla___finally    | 0.286-0.003 | 0.389-0.041 | 0.208-0.002 | 0.107-0.002 |
| allenai/ai2_arc--128LoRD-VI___period512 | 0.281-0.003 | 0.205-0.079 | 0.204-0.002 | 0.101-0.003 |
| allenai/ai2_arc--128vanilla___finally   | 0.282-0.004 | 0.305-0.056 | 0.204-0.003 | 0.103-0.005 |
| allenai/ai2_arc--256LoRD-VI___period512 |  0.28-0.006 | 0.285-0.103 | 0.204-0.005 | 0.106-0.003 |
| allenai/ai2_arc--256vanilla___finally   | 0.284-0.004 | 0.279-0.062 | 0.207-0.003 | 0.105-0.006 |
| allenai/ai2_arc--512LoRD-VI___period512 | 0.285-0.001 | 0.316-0.121 | 0.207-0.001 | 0.102-0.003 |
| allenai/ai2_arc--512vanilla___finally   | 0.283-0.003 | 0.242-0.076 | 0.206-0.002 | 0.103-0.006 |
|-----------------------------------------+-------------+-------------+-------------+-------------|


SETTINGS: DELTA (DONOT USE 512 STEP'S CHECKPOINTS) [5 times]

|-----------------------------------------------------------------------------+-------------+-------------+-------------+-------------|
| fname                                                                       |         acc |           p |           r |          f1 |
|-----------------------------------------------------------------------------+-------------+-------------+-------------+-------------|
| piqa--__qa_ckpts__QAAAnewpiqa645LoRD-VI___period64                          | 0.705-0.072 |  0.76-0.027 | 0.704-0.073 | 0.683-0.096 |
| piqa--__qa_ckpts__QAAAnewpiqa645vanilla___finally                           |  0.76-0.021 | 0.771-0.007 |  0.76-0.021 | 0.757-0.025 |
| piqa--__qa_ckpts__QAAAnewpiqa1285LoRD-VI___period128                        | 0.753-0.038 | 0.775-0.012 | 0.753-0.039 | 0.747-0.048 |
| piqa--__qa_ckpts__QAAAnewpiqa1285vanilla___finally                          | 0.774-0.022 |  0.784-0.02 | 0.774-0.022 | 0.771-0.023 |
| piqa--__qa_ckpts__QAAAnewpiqa2565LoRD-VI___period256                        | 0.785-0.014 | 0.792-0.012 | 0.785-0.014 | 0.783-0.014 |
| piqa--__qa_ckpts__QAAAnewpiqa2565vanilla___finally                          | 0.782-0.005 | 0.788-0.004 | 0.782-0.006 | 0.781-0.007 |
| piqa--__qa_ckpts__QAAAnewpiqa5125LoRD-VI___period512                        | 0.772-0.044 | 0.799-0.014 | 0.771-0.045 | 0.765-0.054 |
| piqa--__qa_ckpts__QAAAnewpiqa5125vanilla___finally                          | 0.788-0.023 | 0.798-0.017 | 0.787-0.023 | 0.785-0.024 |
|-----------------------------------------------------------------------------+-------------+-------------+-------------+-------------|
| truthful_qa--__qa_ckpts__QAAAnewtruthful_qa645LoRD-VI___period64            | 0.345-0.075 |     0.5-0.0 | 0.173-0.037 | 0.255-0.042 |
| truthful_qa--__qa_ckpts__QAAAnewtruthful_qa645vanilla___finally             | 0.381-0.173 |     0.5-0.0 |  0.19-0.087 | 0.266-0.093 |
| truthful_qa--__qa_ckpts__QAAAnewtruthful_qa1285LoRD-VI___period128          | 0.397-0.231 |     0.5-0.0 | 0.199-0.115 |  0.264-0.15 |
| truthful_qa--__qa_ckpts__QAAAnewtruthful_qa1285vanilla___finally            | 0.454-0.069 |     0.5-0.0 | 0.227-0.034 | 0.311-0.034 |
| truthful_qa--__qa_ckpts__QAAAnewtruthful_qa2565LoRD-VI___period256          | 0.292-0.204 |     0.5-0.0 | 0.146-0.102 | 0.209-0.131 |
| truthful_qa--__qa_ckpts__QAAAnewtruthful_qa2565vanilla___finally            | 0.446-0.053 |     0.5-0.0 | 0.223-0.026 | 0.308-0.026 |
| truthful_qa--__qa_ckpts__QAAAnewtruthful_qa5125LoRD-VI___period512          | 0.357-0.132 |     0.5-0.0 | 0.179-0.066 | 0.257-0.076 |
| truthful_qa--__qa_ckpts__QAAAnewtruthful_qa5125vanilla___finally            | 0.426-0.037 |     0.5-0.0 | 0.213-0.018 | 0.299-0.018 |
|-----------------------------------------------------------------------------+-------------+-------------+-------------+-------------|
| allenai/ai2_arc--__qa_ckpts__QAAAnewallenai__ai2_arc645LoRD-VI___period64   | 0.286-0.003 | 0.379-0.085 | 0.208-0.002 | 0.105-0.001 |
| allenai/ai2_arc--__qa_ckpts__QAAAnewallenai__ai2_arc645vanilla___finally    | 0.286-0.003 | 0.389-0.041 | 0.208-0.002 | 0.107-0.002 |
| allenai/ai2_arc--__qa_ckpts__QAAAnewallenai__ai2_arc1285LoRD-VI___period128 |  0.28-0.004 |  0.29-0.065 | 0.203-0.003 | 0.104-0.001 |
| allenai/ai2_arc--__qa_ckpts__QAAAnewallenai__ai2_arc1285vanilla___finally   | 0.282-0.004 | 0.305-0.056 | 0.204-0.003 | 0.103-0.005 |
| allenai/ai2_arc--__qa_ckpts__QAAAnewallenai__ai2_arc2565LoRD-VI___period256 | 0.278-0.004 |  0.244-0.05 | 0.203-0.003 | 0.106-0.003 |
| allenai/ai2_arc--__qa_ckpts__QAAAnewallenai__ai2_arc2565vanilla___finally   | 0.284-0.004 | 0.279-0.062 | 0.207-0.003 | 0.105-0.006 |
| allenai/ai2_arc--__qa_ckpts__QAAAnewallenai__ai2_arc5125LoRD-VI___period512 | 0.285-0.001 | 0.316-0.121 | 0.207-0.001 | 0.102-0.003 |
| allenai/ai2_arc--__qa_ckpts__QAAAnewallenai__ai2_arc5125vanilla___finally   | 0.283-0.003 | 0.242-0.076 | 0.206-0.002 | 0.103-0.006 |
|-----------------------------------------------------------------------------+-------------+-------------+-------------+-------------|



SETTINGS: P_\theta_t, FOR hyper-parameter SEARCH [5 times]


|---------------------------------------+-------------+-------------+-------------+-------------+------+------|
| fname                                 |         acc |           p |           r |          f1 | tau1 | tau2 |
|---------------------------------------+-------------+-------------+-------------+-------------+------+------|
| piqaTAU1070piqa645LoRD-VI___period512 | 0.752-0.027 | 0.766-0.014 | 0.752-0.028 | 0.748-0.032 | 0.70 |  1.0 |
| piqaTAU1075piqa645LoRD-VI___period512 | 0.766-0.009 |   0.77-0.01 | 0.766-0.009 | 0.765-0.009 | 0.75 |  1.0 |
| piqaTAU1080piqa645LoRD-VI___period512 |  0.767-0.01 | 0.777-0.009 |  0.767-0.01 | 0.765-0.011 | 0.80 |  1.0 |
| piqaTAU1085piqa645LoRD-VI___period512 | 0.757-0.009 | 0.766-0.006 | 0.757-0.009 |  0.755-0.01 | 0.85 |  1.0 |
| piqaTAU1090piqa645LoRD-VI___period512 |  0.75-0.009 | 0.763-0.013 | 0.749-0.009 | 0.746-0.009 | 0.90 |  1.0 |
| piqaTAU1095piqa645LoRD-VI___period512 | 0.743-0.017 |  0.77-0.013 | 0.742-0.017 | 0.736-0.021 | 0.95 |  1.0 |
| piqaTAU110piqa645LoRD-VI___period512  | 0.762-0.017 | 0.772-0.012 | 0.762-0.017 |  0.76-0.018 | 1.00 |  1.0 |
|---------------------------------------+-------------+-------------+-------------+-------------+------+------|
| piqaTAU1070piqa645LoRD-VI___period64  | 0.741-0.019 |  0.76-0.015 |  0.741-0.02 | 0.736-0.023 | 0.70 |  1.0 |
| piqaTAU1075piqa645LoRD-VI___period64  | 0.725-0.045 |  0.77-0.015 | 0.725-0.046 | 0.711-0.058 | 0.75 |  1.0 |
| piqaTAU1080piqa645LoRD-VI___period64  | 0.737-0.054 | 0.765-0.017 | 0.737-0.054 | 0.727-0.074 | 0.80 |  1.0 |
| piqaTAU1085piqa645LoRD-VI___period64  | 0.761-0.018 |  0.774-0.02 | 0.761-0.018 | 0.758-0.019 | 0.85 |  1.0 |
| piqaTAU1090piqa645LoRD-VI___period64  | 0.748-0.042 |  0.77-0.012 | 0.747-0.043 |  0.74-0.054 | 0.90 |  1.0 |
| piqaTAU1095piqa645LoRD-VI___period64  | 0.758-0.021 |  0.77-0.016 | 0.758-0.021 | 0.755-0.024 | 0.95 |  1.0 |
| piqaTAU110piqa645LoRD-VI___period64   |  0.77-0.011 |  0.772-0.01 |  0.77-0.011 |  0.77-0.011 | 1.00 |  1.0 |
|---------------------------------------+-------------+-------------+-------------+-------------+------+------|



|----------------------------------------------+-------------+-------------+-------------+-------------+------+------|
| fname                                        |         acc |           p |           r |          f1 | tau1 | tau2 |
|----------------------------------------------+-------------+-------------+-------------+-------------+------+------|
| piqaTAU1080TAU2080piqa645LoRD-VI___period512 | 0.774-0.019 | 0.785-0.024 | 0.774-0.019 | 0.772-0.018 | 0.80 | 0.80 |
| piqaTAU1080TAU2085piqa645LoRD-VI___period512 | 0.785-0.013 | 0.795-0.008 | 0.785-0.013 | 0.783-0.015 | 0.80 | 0.85 |
| piqaTAU1080TAU2090piqa645LoRD-VI___period512 | 0.776-0.014 | 0.779-0.012 | 0.776-0.014 | 0.776-0.014 | 0.80 | 0.90 |
| piqaTAU1080TAU2095piqa645LoRD-VI___period512 | 0.765-0.013 | 0.774-0.008 | 0.765-0.013 | 0.763-0.015 | 0.80 | 0.95 |
| piqaTAU1080TAU210piqa645LoRD-VI___period512  | 0.772-0.017 | 0.777-0.014 | 0.771-0.018 |  0.77-0.018 | 0.80 | 1.00 |
|----------------------------------------------+-------------+-------------+-------------+-------------+------+------|

Conclusion: BEST HYPER-PARAMETER: 0.80, 0.85


Summary of nowaday's results in QA datasets:


|---------------------------------------------------+-------------+-------------+-------------+-------------|
| fname                                             |         acc |           p |           r |          f1 |
|---------------------------------------------------+-------------+-------------+-------------+-------------|
| piqaTAU1080TAU2085piqa645LoRD-VI___period512      | 0.785-0.013 | 0.795-0.008 | 0.785-0.013 | 0.783-0.015 |
| piqa--__qa_ckpts__QAAAnewpiqa645vanilla___finally |  0.76-0.021 | 0.771-0.007 |  0.76-0.021 | 0.757-0.025 |
|---------------------------------------------------+-------------+-------------+-------------+-------------|
| truthful_qa--645LoRD-VI___period512               | 0.408-0.053 |     0.5-0.0 | 0.204-0.026 | 0.289-0.027 |
| truthful_qa--645vanilla___finally                 | 0.381-0.173 |     0.5-0.0 |  0.19-0.087 | 0.266-0.093 |
|---------------------------------------------------+-------------+-------------+-------------+-------------|
| allenai/ai2_arc--645LoRD-VI___period512           | 0.286-0.002 |  0.336-0.11 | 0.208-0.002 | 0.103-0.003 |
| allenai/ai2_arc--645vanilla___finally             | 0.286-0.003 | 0.389-0.041 | 0.208-0.002 | 0.107-0.002 |
|---------------------------------------------------+-------------+-------------+-------------+-------------|


*Varying sequence length* Experiments: *NO CHANGES* when sequence increases.

|----------------------------------------------+-------------+-------------+-------------+-------------|
| piqaTAU1080TAU2085piqa645LoRD-VI___period512 | 0.785-0.013 | 0.795-0.008 | 0.785-0.013 | 0.783-0.015 |
| piqa--1285LoRD-VI___period512                | 0.782-0.026 | 0.793-0.018 | 0.782-0.026 | 0.779-0.028 |
| piqa--2565LoRD-VI___period512                | 0.782-0.014 | 0.788-0.012 | 0.781-0.014 |  0.78-0.015 |
| piqa--5125LoRD-VI___period512                | 0.772-0.025 | 0.795-0.011 | 0.771-0.025 | 0.766-0.029 |
|----------------------------------------------+-------------+-------------+-------------+-------------|
| truthful_qa--645LoRD-VI___period512          | 0.408-0.053 |     0.5-0.0 | 0.204-0.026 | 0.289-0.027 |
| truthful_qa--1285LoRD-VI___period512         | 0.539-0.051 |     0.5-0.0 |  0.27-0.025 |  0.35-0.021 |
| truthful_qa--2565LoRD-VI___period512         | 0.379-0.118 |     0.5-0.0 | 0.189-0.059 |  0.27-0.064 |
| truthful_qa--5125LoRD-VI___period512         |  0.38-0.101 |     0.5-0.0 |   0.19-0.05 |  0.273-0.05 |
|----------------------------------------------+-------------+-------------+-------------+-------------|
| allenai/ai2_arc--645LoRD-VI___period512      | 0.286-0.002 |  0.336-0.11 | 0.208-0.002 | 0.103-0.003 |
| allenai/ai2_arc--1285LoRD-VI___period512     | 0.278-0.005 |  0.19-0.046 | 0.202-0.004 |   0.1-0.003 |
| allenai/ai2_arc--2565LoRD-VI___period512     | 0.283-0.006 |  0.31-0.095 | 0.206-0.004 |  0.11-0.003 |
| allenai/ai2_arc--5125LoRD-VI___period512     | 0.286-0.002 | 0.336-0.137 | 0.207-0.001 | 0.103-0.003 |
|----------------------------------------------+-------------+-------------+-------------+-------------|

