doc/exper_v2.html

<div id="outline-container-orgcd03d3f" class="outline-2">
<h2 id="orgcd03d3f"><span class="section-number-2">2.</span> QAs</h2>
<div class="outline-text-2" id="text-2">
<p>
SETTINGS: P_&theta;_t  [1 times] NSD
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">fname</th>
<th scope="col" class="org-right">acc</th>
<th scope="col" class="org-right">p</th>
<th scope="col" class="org-right">r</th>
<th scope="col" class="org-right">f1</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">piqa&#x2013;&#x2014;./qa_ckpts/QAAAnewpiqa5121LoRD-VI___period512/</td>
<td class="org-right">0.766</td>
<td class="org-right">0.797</td>
<td class="org-right">0.765</td>
<td class="org-right">0.759</td>
</tr>

<tr>
<td class="org-left">piqa&#x2013;&#x2014;./qa_ckpts/QAAAnewpiqa5121vanilla___finally/</td>
<td class="org-right">0.796</td>
<td class="org-right">0.811</td>
<td class="org-right">0.796</td>
<td class="org-right">0.793</td>
</tr>

<tr>
<td class="org-left">piqa&#x2013;&#x2014;./qa_ckpts/QAAAnewpiqa2561LoRD-VI___period256/</td>
<td class="org-right">0.784</td>
<td class="org-right">0.788</td>
<td class="org-right">0.784</td>
<td class="org-right">0.783</td>
</tr>

<tr>
<td class="org-left">piqa&#x2013;&#x2014;./qa_ckpts/QAAAnewpiqa2561vanilla___finally/</td>
<td class="org-right">0.776</td>
<td class="org-right">0.788</td>
<td class="org-right">0.776</td>
<td class="org-right">0.774</td>
</tr>

<tr>
<td class="org-left">piqa&#x2013;&#x2014;./qa_ckpts/QAAAnewpiqa1281LoRD-VI___period128/</td>
<td class="org-right">0.768</td>
<td class="org-right">0.791</td>
<td class="org-right">0.767</td>
<td class="org-right">0.763</td>
</tr>

<tr>
<td class="org-left">piqa&#x2013;&#x2014;./qa_ckpts/QAAAnewpiqa1281vanilla___finally/</td>
<td class="org-right">0.788</td>
<td class="org-right">0.807</td>
<td class="org-right">0.788</td>
<td class="org-right">0.784</td>
</tr>

<tr>
<td class="org-left">piqa&#x2013;&#x2014;./qa_ckpts/QAAAnewpiqa641LoRD-VI___period64/</td>
<td class="org-right">0.67</td>
<td class="org-right">0.756</td>
<td class="org-right">0.671</td>
<td class="org-right">0.641</td>
</tr>

<tr>
<td class="org-left">piqa&#x2013;&#x2014;./qa_ckpts/QAAAnewpiqa641vanilla___finally/</td>
<td class="org-right">0.728</td>
<td class="org-right">0.755</td>
<td class="org-right">0.727</td>
<td class="org-right">0.72</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">truthful_qa&#x2013;&#x2014;./qa_ckpts/QAAAnewtruthful_qa5121LoRD-VI___period512/</td>
<td class="org-right">0.324</td>
<td class="org-right">0.5</td>
<td class="org-right">0.162</td>
<td class="org-right">0.245</td>
</tr>

<tr>
<td class="org-left">truthful_qa&#x2013;&#x2014;./qa_ckpts/QAAAnewtruthful_qa5121vanilla___finally/</td>
<td class="org-right">0.472</td>
<td class="org-right">0.5</td>
<td class="org-right">0.236</td>
<td class="org-right">0.321</td>
</tr>

<tr>
<td class="org-left">truthful_qa&#x2013;&#x2014;./qa_ckpts/QAAAnewtruthful_qa2561LoRD-VI___period256/</td>
<td class="org-right">0.198</td>
<td class="org-right">0.5</td>
<td class="org-right">0.099</td>
<td class="org-right">0.165</td>
</tr>

<tr>
<td class="org-left">truthful_qa&#x2013;&#x2014;./qa_ckpts/QAAAnewtruthful_qa2561vanilla___finally/</td>
<td class="org-right">0.365</td>
<td class="org-right">0.5</td>
<td class="org-right">0.182</td>
<td class="org-right">0.267</td>
</tr>

<tr>
<td class="org-left">truthful_qa&#x2013;&#x2014;./qa_ckpts/QAAAnewtruthful_qa1281LoRD-VI___period128/</td>
<td class="org-right">0.569</td>
<td class="org-right">0.5</td>
<td class="org-right">0.285</td>
<td class="org-right">0.363</td>
</tr>

<tr>
<td class="org-left">truthful_qa&#x2013;&#x2014;./qa_ckpts/QAAAnewtruthful_qa1281vanilla___finally/</td>
<td class="org-right">0.45</td>
<td class="org-right">0.5</td>
<td class="org-right">0.225</td>
<td class="org-right">0.311</td>
</tr>

<tr>
<td class="org-left">truthful_qa&#x2013;&#x2014;./qa_ckpts/QAAAnewtruthful_qa641LoRD-VI___period64/</td>
<td class="org-right">0.25</td>
<td class="org-right">0.5</td>
<td class="org-right">0.125</td>
<td class="org-right">0.2</td>
</tr>

<tr>
<td class="org-left">truthful_qa&#x2013;&#x2014;./qa_ckpts/QAAAnewtruthful_qa641vanilla___finally/</td>
<td class="org-right">0.436</td>
<td class="org-right">0.5</td>
<td class="org-right">0.218</td>
<td class="org-right">0.303</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">allenai/ai2_arc&#x2013;&#x2014;./qa_ckpts/QAAAnewallenai/ai2_arc5121LoRD-VI___period512/</td>
<td class="org-right">0.288</td>
<td class="org-right">0.456</td>
<td class="org-right">0.209</td>
<td class="org-right">0.105</td>
</tr>

<tr>
<td class="org-left">allenai/ai2_arc&#x2013;&#x2014;./qa_ckpts/QAAAnewallenai/ai2_arc5121vanilla___finally/</td>
<td class="org-right">0.278</td>
<td class="org-right">0.238</td>
<td class="org-right">0.202</td>
<td class="org-right">0.102</td>
</tr>

<tr>
<td class="org-left">allenai/ai2_arc&#x2013;&#x2014;./qa_ckpts/QAAAnewallenai/ai2_arc2561LoRD-VI___period256/</td>
<td class="org-right">0.281</td>
<td class="org-right">0.322</td>
<td class="org-right">0.205</td>
<td class="org-right">0.108</td>
</tr>

<tr>
<td class="org-left">allenai/ai2_arc&#x2013;&#x2014;./qa_ckpts/QAAAnewallenai/ai2_arc2561vanilla___finally/</td>
<td class="org-right">0.288</td>
<td class="org-right">0.389</td>
<td class="org-right">0.209</td>
<td class="org-right">0.11</td>
</tr>

<tr>
<td class="org-left">allenai/ai2_arc&#x2013;&#x2014;./qa_ckpts/QAAAnewallenai/ai2_arc1281LoRD-VI___period128/</td>
<td class="org-right">0.284</td>
<td class="org-right">0.289</td>
<td class="org-right">0.207</td>
<td class="org-right">0.104</td>
</tr>

<tr>
<td class="org-left">allenai/ai2_arc&#x2013;&#x2014;./qa_ckpts/QAAAnewallenai/ai2_arc1281vanilla___finally/</td>
<td class="org-right">0.278</td>
<td class="org-right">0.288</td>
<td class="org-right">0.202</td>
<td class="org-right">0.107</td>
</tr>

<tr>
<td class="org-left">allenai/ai2_arc&#x2013;&#x2014;./qa_ckpts/QAAAnewallenai/ai2_arc641LoRD-VI___period64/</td>
<td class="org-right">0.284</td>
<td class="org-right">0.156</td>
<td class="org-right">0.206</td>
<td class="org-right">0.1</td>
</tr>

<tr>
<td class="org-left">allenai/ai2_arc&#x2013;&#x2014;./qa_ckpts/QAAAnewallenai/ai2_arc641vanilla___finally/</td>
<td class="org-right">0.278</td>
<td class="org-right">0.254</td>
<td class="org-right">0.202</td>
<td class="org-right">0.107</td>
</tr>
</tbody>
</table>


<p>
SETTINGS: DELTA [5 times] hard to say
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">fname</th>
<th scope="col" class="org-right">acc</th>
<th scope="col" class="org-right">p</th>
<th scope="col" class="org-right">r</th>
<th scope="col" class="org-right">f1</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">piqa&#x2013;64LoRD-VI___period512</td>
<td class="org-right">0.769-0.011</td>
<td class="org-right">0.779-0.014</td>
<td class="org-right">0.769-0.011</td>
<td class="org-right">0.767-0.011</td>
</tr>

<tr>
<td class="org-left">piqa&#x2013;64vanilla___finally</td>
<td class="org-right">0.76-0.021</td>
<td class="org-right">0.771-0.007</td>
<td class="org-right">0.76-0.021</td>
<td class="org-right">0.757-0.025</td>
</tr>

<tr>
<td class="org-left">piqa&#x2013;128LoRD-VI___period512</td>
<td class="org-right">0.749-0.032</td>
<td class="org-right">0.764-0.014</td>
<td class="org-right">0.748-0.032</td>
<td class="org-right">0.744-0.039</td>
</tr>

<tr>
<td class="org-left">piqa&#x2013;128vanilla___finally</td>
<td class="org-right">0.774-0.022</td>
<td class="org-right">0.784-0.02</td>
<td class="org-right">0.774-0.022</td>
<td class="org-right">0.771-0.023</td>
</tr>

<tr>
<td class="org-left">piqa&#x2013;256LoRD-VI___period512</td>
<td class="org-right">0.789-0.021</td>
<td class="org-right">0.791-0.022</td>
<td class="org-right">0.789-0.021</td>
<td class="org-right">0.788-0.021</td>
</tr>

<tr>
<td class="org-left">piqa&#x2013;256vanilla___finally</td>
<td class="org-right">0.782-0.005</td>
<td class="org-right">0.788-0.004</td>
<td class="org-right">0.782-0.006</td>
<td class="org-right">0.781-0.007</td>
</tr>

<tr>
<td class="org-left">piqa&#x2013;512LoRD-VI___period512</td>
<td class="org-right">0.772-0.044</td>
<td class="org-right">0.799-0.014</td>
<td class="org-right">0.771-0.045</td>
<td class="org-right">0.765-0.054</td>
</tr>

<tr>
<td class="org-left">piqa&#x2013;512vanilla___finally</td>
<td class="org-right">0.788-0.023</td>
<td class="org-right">0.798-0.017</td>
<td class="org-right">0.787-0.023</td>
<td class="org-right">0.785-0.024</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">truthful_qa&#x2013;64LoRD-VI___period512</td>
<td class="org-right">0.451-0.055</td>
<td class="org-right">0.5-0.0</td>
<td class="org-right">0.226-0.027</td>
<td class="org-right">0.31-0.026</td>
</tr>

<tr>
<td class="org-left">truthful_qa&#x2013;64vanilla___finally</td>
<td class="org-right">0.381-0.173</td>
<td class="org-right">0.5-0.0</td>
<td class="org-right">0.19-0.087</td>
<td class="org-right">0.266-0.093</td>
</tr>

<tr>
<td class="org-left">truthful_qa&#x2013;128LoRD-VI___period512</td>
<td class="org-right">0.432-0.052</td>
<td class="org-right">0.5-0.0</td>
<td class="org-right">0.216-0.026</td>
<td class="org-right">0.301-0.026</td>
</tr>

<tr>
<td class="org-left">truthful_qa&#x2013;128vanilla___finally</td>
<td class="org-right">0.454-0.069</td>
<td class="org-right">0.5-0.0</td>
<td class="org-right">0.227-0.034</td>
<td class="org-right">0.311-0.034</td>
</tr>

<tr>
<td class="org-left">truthful_qa&#x2013;256LoRD-VI___period512</td>
<td class="org-right">0.363-0.094</td>
<td class="org-right">0.5-0.0</td>
<td class="org-right">0.181-0.047</td>
<td class="org-right">0.263-0.054</td>
</tr>

<tr>
<td class="org-left">truthful_qa&#x2013;256vanilla___finally</td>
<td class="org-right">0.446-0.053</td>
<td class="org-right">0.5-0.0</td>
<td class="org-right">0.223-0.026</td>
<td class="org-right">0.308-0.026</td>
</tr>

<tr>
<td class="org-left">truthful_qa&#x2013;512LoRD-VI___period512</td>
<td class="org-right">0.357-0.132</td>
<td class="org-right">0.5-0.0</td>
<td class="org-right">0.179-0.066</td>
<td class="org-right">0.257-0.076</td>
</tr>

<tr>
<td class="org-left">truthful_qa&#x2013;512vanilla___finally</td>
<td class="org-right">0.426-0.037</td>
<td class="org-right">0.5-0.0</td>
<td class="org-right">0.213-0.018</td>
<td class="org-right">0.299-0.018</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">allenai/ai2_arc&#x2013;64LoRD-VI___period512</td>
<td class="org-right">0.288-0.003</td>
<td class="org-right">0.39-0.116</td>
<td class="org-right">0.21-0.002</td>
<td class="org-right">0.106-0.005</td>
</tr>

<tr>
<td class="org-left">allenai/ai2_arc&#x2013;64vanilla___finally</td>
<td class="org-right">0.286-0.003</td>
<td class="org-right">0.389-0.041</td>
<td class="org-right">0.208-0.002</td>
<td class="org-right">0.107-0.002</td>
</tr>

<tr>
<td class="org-left">allenai/ai2_arc&#x2013;128LoRD-VI___period512</td>
<td class="org-right">0.281-0.003</td>
<td class="org-right">0.205-0.079</td>
<td class="org-right">0.204-0.002</td>
<td class="org-right">0.101-0.003</td>
</tr>

<tr>
<td class="org-left">allenai/ai2_arc&#x2013;128vanilla___finally</td>
<td class="org-right">0.282-0.004</td>
<td class="org-right">0.305-0.056</td>
<td class="org-right">0.204-0.003</td>
<td class="org-right">0.103-0.005</td>
</tr>

<tr>
<td class="org-left">allenai/ai2_arc&#x2013;256LoRD-VI___period512</td>
<td class="org-right">0.28-0.006</td>
<td class="org-right">0.285-0.103</td>
<td class="org-right">0.204-0.005</td>
<td class="org-right">0.106-0.003</td>
</tr>

<tr>
<td class="org-left">allenai/ai2_arc&#x2013;256vanilla___finally</td>
<td class="org-right">0.284-0.004</td>
<td class="org-right">0.279-0.062</td>
<td class="org-right">0.207-0.003</td>
<td class="org-right">0.105-0.006</td>
</tr>

<tr>
<td class="org-left">allenai/ai2_arc&#x2013;512LoRD-VI___period512</td>
<td class="org-right">0.285-0.001</td>
<td class="org-right">0.316-0.121</td>
<td class="org-right">0.207-0.001</td>
<td class="org-right">0.102-0.003</td>
</tr>

<tr>
<td class="org-left">allenai/ai2_arc&#x2013;512vanilla___finally</td>
<td class="org-right">0.283-0.003</td>
<td class="org-right">0.242-0.076</td>
<td class="org-right">0.206-0.002</td>
<td class="org-right">0.103-0.006</td>
</tr>
</tbody>
</table>


<p>
SETTINGS: DELTA (DONOT USE 512 STEP'S CHECKPOINTS) [5 times]
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">fname</th>
<th scope="col" class="org-right">acc</th>
<th scope="col" class="org-right">p</th>
<th scope="col" class="org-right">r</th>
<th scope="col" class="org-right">f1</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">piqa&#x2013;__qa_ckpts__QAAAnewpiqa645LoRD-VI___period64</td>
<td class="org-right">0.705-0.072</td>
<td class="org-right">0.76-0.027</td>
<td class="org-right">0.704-0.073</td>
<td class="org-right">0.683-0.096</td>
</tr>

<tr>
<td class="org-left">piqa&#x2013;__qa_ckpts__QAAAnewpiqa645vanilla___finally</td>
<td class="org-right">0.76-0.021</td>
<td class="org-right">0.771-0.007</td>
<td class="org-right">0.76-0.021</td>
<td class="org-right">0.757-0.025</td>
</tr>

<tr>
<td class="org-left">piqa&#x2013;__qa_ckpts__QAAAnewpiqa1285LoRD-VI___period128</td>
<td class="org-right">0.753-0.038</td>
<td class="org-right">0.775-0.012</td>
<td class="org-right">0.753-0.039</td>
<td class="org-right">0.747-0.048</td>
</tr>

<tr>
<td class="org-left">piqa&#x2013;__qa_ckpts__QAAAnewpiqa1285vanilla___finally</td>
<td class="org-right">0.774-0.022</td>
<td class="org-right">0.784-0.02</td>
<td class="org-right">0.774-0.022</td>
<td class="org-right">0.771-0.023</td>
</tr>

<tr>
<td class="org-left">piqa&#x2013;__qa_ckpts__QAAAnewpiqa2565LoRD-VI___period256</td>
<td class="org-right">0.785-0.014</td>
<td class="org-right">0.792-0.012</td>
<td class="org-right">0.785-0.014</td>
<td class="org-right">0.783-0.014</td>
</tr>

<tr>
<td class="org-left">piqa&#x2013;__qa_ckpts__QAAAnewpiqa2565vanilla___finally</td>
<td class="org-right">0.782-0.005</td>
<td class="org-right">0.788-0.004</td>
<td class="org-right">0.782-0.006</td>
<td class="org-right">0.781-0.007</td>
</tr>

<tr>
<td class="org-left">piqa&#x2013;__qa_ckpts__QAAAnewpiqa5125LoRD-VI___period512</td>
<td class="org-right">0.772-0.044</td>
<td class="org-right">0.799-0.014</td>
<td class="org-right">0.771-0.045</td>
<td class="org-right">0.765-0.054</td>
</tr>

<tr>
<td class="org-left">piqa&#x2013;__qa_ckpts__QAAAnewpiqa5125vanilla___finally</td>
<td class="org-right">0.788-0.023</td>
<td class="org-right">0.798-0.017</td>
<td class="org-right">0.787-0.023</td>
<td class="org-right">0.785-0.024</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">truthful_qa&#x2013;__qa_ckpts__QAAAnewtruthful_qa645LoRD-VI___period64</td>
<td class="org-right">0.345-0.075</td>
<td class="org-right">0.5-0.0</td>
<td class="org-right">0.173-0.037</td>
<td class="org-right">0.255-0.042</td>
</tr>

<tr>
<td class="org-left">truthful_qa&#x2013;__qa_ckpts__QAAAnewtruthful_qa645vanilla___finally</td>
<td class="org-right">0.381-0.173</td>
<td class="org-right">0.5-0.0</td>
<td class="org-right">0.19-0.087</td>
<td class="org-right">0.266-0.093</td>
</tr>

<tr>
<td class="org-left">truthful_qa&#x2013;__qa_ckpts__QAAAnewtruthful_qa1285LoRD-VI___period128</td>
<td class="org-right">0.397-0.231</td>
<td class="org-right">0.5-0.0</td>
<td class="org-right">0.199-0.115</td>
<td class="org-right">0.264-0.15</td>
</tr>

<tr>
<td class="org-left">truthful_qa&#x2013;__qa_ckpts__QAAAnewtruthful_qa1285vanilla___finally</td>
<td class="org-right">0.454-0.069</td>
<td class="org-right">0.5-0.0</td>
<td class="org-right">0.227-0.034</td>
<td class="org-right">0.311-0.034</td>
</tr>

<tr>
<td class="org-left">truthful_qa&#x2013;__qa_ckpts__QAAAnewtruthful_qa2565LoRD-VI___period256</td>
<td class="org-right">0.292-0.204</td>
<td class="org-right">0.5-0.0</td>
<td class="org-right">0.146-0.102</td>
<td class="org-right">0.209-0.131</td>
</tr>

<tr>
<td class="org-left">truthful_qa&#x2013;__qa_ckpts__QAAAnewtruthful_qa2565vanilla___finally</td>
<td class="org-right">0.446-0.053</td>
<td class="org-right">0.5-0.0</td>
<td class="org-right">0.223-0.026</td>
<td class="org-right">0.308-0.026</td>
</tr>

<tr>
<td class="org-left">truthful_qa&#x2013;__qa_ckpts__QAAAnewtruthful_qa5125LoRD-VI___period512</td>
<td class="org-right">0.357-0.132</td>
<td class="org-right">0.5-0.0</td>
<td class="org-right">0.179-0.066</td>
<td class="org-right">0.257-0.076</td>
</tr>

<tr>
<td class="org-left">truthful_qa&#x2013;__qa_ckpts__QAAAnewtruthful_qa5125vanilla___finally</td>
<td class="org-right">0.426-0.037</td>
<td class="org-right">0.5-0.0</td>
<td class="org-right">0.213-0.018</td>
<td class="org-right">0.299-0.018</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">allenai/ai2_arc&#x2013;__qa_ckpts__QAAAnewallenai__ai2_arc645LoRD-VI___period64</td>
<td class="org-right">0.286-0.003</td>
<td class="org-right">0.379-0.085</td>
<td class="org-right">0.208-0.002</td>
<td class="org-right">0.105-0.001</td>
</tr>

<tr>
<td class="org-left">allenai/ai2_arc&#x2013;__qa_ckpts__QAAAnewallenai__ai2_arc645vanilla___finally</td>
<td class="org-right">0.286-0.003</td>
<td class="org-right">0.389-0.041</td>
<td class="org-right">0.208-0.002</td>
<td class="org-right">0.107-0.002</td>
</tr>

<tr>
<td class="org-left">allenai/ai2_arc&#x2013;__qa_ckpts__QAAAnewallenai__ai2_arc1285LoRD-VI___period128</td>
<td class="org-right">0.28-0.004</td>
<td class="org-right">0.29-0.065</td>
<td class="org-right">0.203-0.003</td>
<td class="org-right">0.104-0.001</td>
</tr>

<tr>
<td class="org-left">allenai/ai2_arc&#x2013;__qa_ckpts__QAAAnewallenai__ai2_arc1285vanilla___finally</td>
<td class="org-right">0.282-0.004</td>
<td class="org-right">0.305-0.056</td>
<td class="org-right">0.204-0.003</td>
<td class="org-right">0.103-0.005</td>
</tr>

<tr>
<td class="org-left">allenai/ai2_arc&#x2013;__qa_ckpts__QAAAnewallenai__ai2_arc2565LoRD-VI___period256</td>
<td class="org-right">0.278-0.004</td>
<td class="org-right">0.244-0.05</td>
<td class="org-right">0.203-0.003</td>
<td class="org-right">0.106-0.003</td>
</tr>

<tr>
<td class="org-left">allenai/ai2_arc&#x2013;__qa_ckpts__QAAAnewallenai__ai2_arc2565vanilla___finally</td>
<td class="org-right">0.284-0.004</td>
<td class="org-right">0.279-0.062</td>
<td class="org-right">0.207-0.003</td>
<td class="org-right">0.105-0.006</td>
</tr>

<tr>
<td class="org-left">allenai/ai2_arc&#x2013;__qa_ckpts__QAAAnewallenai__ai2_arc5125LoRD-VI___period512</td>
<td class="org-right">0.285-0.001</td>
<td class="org-right">0.316-0.121</td>
<td class="org-right">0.207-0.001</td>
<td class="org-right">0.102-0.003</td>
</tr>

<tr>
<td class="org-left">allenai/ai2_arc&#x2013;__qa_ckpts__QAAAnewallenai__ai2_arc5125vanilla___finally</td>
<td class="org-right">0.283-0.003</td>
<td class="org-right">0.242-0.076</td>
<td class="org-right">0.206-0.002</td>
<td class="org-right">0.103-0.006</td>
</tr>
</tbody>
</table>



<p>
SETTINGS: P_&theta;_t, FOR hyper-parameter SEARCH [5 times]
</p>


<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">fname</th>
<th scope="col" class="org-right">acc</th>
<th scope="col" class="org-right">p</th>
<th scope="col" class="org-right">r</th>
<th scope="col" class="org-right">f1</th>
<th scope="col" class="org-right">tau1</th>
<th scope="col" class="org-right">tau2</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">piqaTAU1070piqa645LoRD-VI___period512</td>
<td class="org-right">0.752-0.027</td>
<td class="org-right">0.766-0.014</td>
<td class="org-right">0.752-0.028</td>
<td class="org-right">0.748-0.032</td>
<td class="org-right">0.70</td>
<td class="org-right">1.0</td>
</tr>

<tr>
<td class="org-left">piqaTAU1075piqa645LoRD-VI___period512</td>
<td class="org-right">0.766-0.009</td>
<td class="org-right">0.77-0.01</td>
<td class="org-right">0.766-0.009</td>
<td class="org-right">0.765-0.009</td>
<td class="org-right">0.75</td>
<td class="org-right">1.0</td>
</tr>

<tr>
<td class="org-left">piqaTAU1080piqa645LoRD-VI___period512</td>
<td class="org-right">0.767-0.01</td>
<td class="org-right">0.777-0.009</td>
<td class="org-right">0.767-0.01</td>
<td class="org-right">0.765-0.011</td>
<td class="org-right">0.80</td>
<td class="org-right">1.0</td>
</tr>

<tr>
<td class="org-left">piqaTAU1085piqa645LoRD-VI___period512</td>
<td class="org-right">0.757-0.009</td>
<td class="org-right">0.766-0.006</td>
<td class="org-right">0.757-0.009</td>
<td class="org-right">0.755-0.01</td>
<td class="org-right">0.85</td>
<td class="org-right">1.0</td>
</tr>

<tr>
<td class="org-left">piqaTAU1090piqa645LoRD-VI___period512</td>
<td class="org-right">0.75-0.009</td>
<td class="org-right">0.763-0.013</td>
<td class="org-right">0.749-0.009</td>
<td class="org-right">0.746-0.009</td>
<td class="org-right">0.90</td>
<td class="org-right">1.0</td>
</tr>

<tr>
<td class="org-left">piqaTAU1095piqa645LoRD-VI___period512</td>
<td class="org-right">0.743-0.017</td>
<td class="org-right">0.77-0.013</td>
<td class="org-right">0.742-0.017</td>
<td class="org-right">0.736-0.021</td>
<td class="org-right">0.95</td>
<td class="org-right">1.0</td>
</tr>

<tr>
<td class="org-left">piqaTAU110piqa645LoRD-VI___period512</td>
<td class="org-right">0.762-0.017</td>
<td class="org-right">0.772-0.012</td>
<td class="org-right">0.762-0.017</td>
<td class="org-right">0.76-0.018</td>
<td class="org-right">1.00</td>
<td class="org-right">1.0</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">piqaTAU1070piqa645LoRD-VI___period64</td>
<td class="org-right">0.741-0.019</td>
<td class="org-right">0.76-0.015</td>
<td class="org-right">0.741-0.02</td>
<td class="org-right">0.736-0.023</td>
<td class="org-right">0.70</td>
<td class="org-right">1.0</td>
</tr>

<tr>
<td class="org-left">piqaTAU1075piqa645LoRD-VI___period64</td>
<td class="org-right">0.725-0.045</td>
<td class="org-right">0.77-0.015</td>
<td class="org-right">0.725-0.046</td>
<td class="org-right">0.711-0.058</td>
<td class="org-right">0.75</td>
<td class="org-right">1.0</td>
</tr>

<tr>
<td class="org-left">piqaTAU1080piqa645LoRD-VI___period64</td>
<td class="org-right">0.737-0.054</td>
<td class="org-right">0.765-0.017</td>
<td class="org-right">0.737-0.054</td>
<td class="org-right">0.727-0.074</td>
<td class="org-right">0.80</td>
<td class="org-right">1.0</td>
</tr>

<tr>
<td class="org-left">piqaTAU1085piqa645LoRD-VI___period64</td>
<td class="org-right">0.761-0.018</td>
<td class="org-right">0.774-0.02</td>
<td class="org-right">0.761-0.018</td>
<td class="org-right">0.758-0.019</td>
<td class="org-right">0.85</td>
<td class="org-right">1.0</td>
</tr>

<tr>
<td class="org-left">piqaTAU1090piqa645LoRD-VI___period64</td>
<td class="org-right">0.748-0.042</td>
<td class="org-right">0.77-0.012</td>
<td class="org-right">0.747-0.043</td>
<td class="org-right">0.74-0.054</td>
<td class="org-right">0.90</td>
<td class="org-right">1.0</td>
</tr>

<tr>
<td class="org-left">piqaTAU1095piqa645LoRD-VI___period64</td>
<td class="org-right">0.758-0.021</td>
<td class="org-right">0.77-0.016</td>
<td class="org-right">0.758-0.021</td>
<td class="org-right">0.755-0.024</td>
<td class="org-right">0.95</td>
<td class="org-right">1.0</td>
</tr>

<tr>
<td class="org-left">piqaTAU110piqa645LoRD-VI___period64</td>
<td class="org-right">0.77-0.011</td>
<td class="org-right">0.772-0.01</td>
<td class="org-right">0.77-0.011</td>
<td class="org-right">0.77-0.011</td>
<td class="org-right">1.00</td>
<td class="org-right">1.0</td>
</tr>
</tbody>
</table>



<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">fname</th>
<th scope="col" class="org-right">acc</th>
<th scope="col" class="org-right">p</th>
<th scope="col" class="org-right">r</th>
<th scope="col" class="org-right">f1</th>
<th scope="col" class="org-right">tau1</th>
<th scope="col" class="org-right">tau2</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">piqaTAU1080TAU2080piqa645LoRD-VI___period512</td>
<td class="org-right">0.774-0.019</td>
<td class="org-right">0.785-0.024</td>
<td class="org-right">0.774-0.019</td>
<td class="org-right">0.772-0.018</td>
<td class="org-right">0.80</td>
<td class="org-right">0.80</td>
</tr>

<tr>
<td class="org-left">piqaTAU1080TAU2085piqa645LoRD-VI___period512</td>
<td class="org-right">0.785-0.013</td>
<td class="org-right">0.795-0.008</td>
<td class="org-right">0.785-0.013</td>
<td class="org-right">0.783-0.015</td>
<td class="org-right">0.80</td>
<td class="org-right">0.85</td>
</tr>

<tr>
<td class="org-left">piqaTAU1080TAU2090piqa645LoRD-VI___period512</td>
<td class="org-right">0.776-0.014</td>
<td class="org-right">0.779-0.012</td>
<td class="org-right">0.776-0.014</td>
<td class="org-right">0.776-0.014</td>
<td class="org-right">0.80</td>
<td class="org-right">0.90</td>
</tr>

<tr>
<td class="org-left">piqaTAU1080TAU2095piqa645LoRD-VI___period512</td>
<td class="org-right">0.765-0.013</td>
<td class="org-right">0.774-0.008</td>
<td class="org-right">0.765-0.013</td>
<td class="org-right">0.763-0.015</td>
<td class="org-right">0.80</td>
<td class="org-right">0.95</td>
</tr>

<tr>
<td class="org-left">piqaTAU1080TAU210piqa645LoRD-VI___period512</td>
<td class="org-right">0.772-0.017</td>
<td class="org-right">0.777-0.014</td>
<td class="org-right">0.771-0.018</td>
<td class="org-right">0.77-0.018</td>
<td class="org-right">0.80</td>
<td class="org-right">1.00</td>
</tr>
</tbody>
</table>

<p>
Conclusion: BEST HYPER-PARAMETER: 0.80, 0.85
</p>


<p>
Summary of nowaday's results in QA datasets:
</p>


<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">fname</th>
<th scope="col" class="org-right">acc</th>
<th scope="col" class="org-right">p</th>
<th scope="col" class="org-right">r</th>
<th scope="col" class="org-right">f1</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">piqaTAU1080TAU2085piqa645LoRD-VI___period512</td>
<td class="org-right">0.785-0.013</td>
<td class="org-right">0.795-0.008</td>
<td class="org-right">0.785-0.013</td>
<td class="org-right">0.783-0.015</td>
</tr>

<tr>
<td class="org-left">piqa&#x2013;__qa_ckpts__QAAAnewpiqa645vanilla___finally</td>
<td class="org-right">0.76-0.021</td>
<td class="org-right">0.771-0.007</td>
<td class="org-right">0.76-0.021</td>
<td class="org-right">0.757-0.025</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">truthful_qa&#x2013;645LoRD-VI___period512</td>
<td class="org-right">0.408-0.053</td>
<td class="org-right">0.5-0.0</td>
<td class="org-right">0.204-0.026</td>
<td class="org-right">0.289-0.027</td>
</tr>

<tr>
<td class="org-left">truthful_qa&#x2013;645vanilla___finally</td>
<td class="org-right">0.381-0.173</td>
<td class="org-right">0.5-0.0</td>
<td class="org-right">0.19-0.087</td>
<td class="org-right">0.266-0.093</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">allenai/ai2_arc&#x2013;645LoRD-VI___period512</td>
<td class="org-right">0.286-0.002</td>
<td class="org-right">0.336-0.11</td>
<td class="org-right">0.208-0.002</td>
<td class="org-right">0.103-0.003</td>
</tr>

<tr>
<td class="org-left">allenai/ai2_arc&#x2013;645vanilla___finally</td>
<td class="org-right">0.286-0.003</td>
<td class="org-right">0.389-0.041</td>
<td class="org-right">0.208-0.002</td>
<td class="org-right">0.107-0.002</td>
</tr>
</tbody>
</table>


<p>
<b>Varying sequence length</b> Experiments: <b>NO CHANGES</b> when sequence increases.
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">piqaTAU1080TAU2085piqa645LoRD-VI___period512</th>
<th scope="col" class="org-right">0.785-0.013</th>
<th scope="col" class="org-right">0.795-0.008</th>
<th scope="col" class="org-right">0.785-0.013</th>
<th scope="col" class="org-right">0.783-0.015</th>
</tr>

<tr>
<th scope="col" class="org-left">piqa&#x2013;1285LoRD-VI___period512</th>
<th scope="col" class="org-right">0.782-0.026</th>
<th scope="col" class="org-right">0.793-0.018</th>
<th scope="col" class="org-right">0.782-0.026</th>
<th scope="col" class="org-right">0.779-0.028</th>
</tr>

<tr>
<th scope="col" class="org-left">piqa&#x2013;2565LoRD-VI___period512</th>
<th scope="col" class="org-right">0.782-0.014</th>
<th scope="col" class="org-right">0.788-0.012</th>
<th scope="col" class="org-right">0.781-0.014</th>
<th scope="col" class="org-right">0.78-0.015</th>
</tr>

<tr>
<th scope="col" class="org-left">piqa&#x2013;5125LoRD-VI___period512</th>
<th scope="col" class="org-right">0.772-0.025</th>
<th scope="col" class="org-right">0.795-0.011</th>
<th scope="col" class="org-right">0.771-0.025</th>
<th scope="col" class="org-right">0.766-0.029</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">truthful_qa&#x2013;645LoRD-VI___period512</td>
<td class="org-right">0.408-0.053</td>
<td class="org-right">0.5-0.0</td>
<td class="org-right">0.204-0.026</td>
<td class="org-right">0.289-0.027</td>
</tr>

<tr>
<td class="org-left">truthful_qa&#x2013;1285LoRD-VI___period512</td>
<td class="org-right">0.539-0.051</td>
<td class="org-right">0.5-0.0</td>
<td class="org-right">0.27-0.025</td>
<td class="org-right">0.35-0.021</td>
</tr>

<tr>
<td class="org-left">truthful_qa&#x2013;2565LoRD-VI___period512</td>
<td class="org-right">0.379-0.118</td>
<td class="org-right">0.5-0.0</td>
<td class="org-right">0.189-0.059</td>
<td class="org-right">0.27-0.064</td>
</tr>

<tr>
<td class="org-left">truthful_qa&#x2013;5125LoRD-VI___period512</td>
<td class="org-right">0.38-0.101</td>
<td class="org-right">0.5-0.0</td>
<td class="org-right">0.19-0.05</td>
<td class="org-right">0.273-0.05</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">allenai/ai2_arc&#x2013;645LoRD-VI___period512</td>
<td class="org-right">0.286-0.002</td>
<td class="org-right">0.336-0.11</td>
<td class="org-right">0.208-0.002</td>
<td class="org-right">0.103-0.003</td>
</tr>

<tr>
<td class="org-left">allenai/ai2_arc&#x2013;1285LoRD-VI___period512</td>
<td class="org-right">0.278-0.005</td>
<td class="org-right">0.19-0.046</td>
<td class="org-right">0.202-0.004</td>
<td class="org-right">0.1-0.003</td>
</tr>

<tr>
<td class="org-left">allenai/ai2_arc&#x2013;2565LoRD-VI___period512</td>
<td class="org-right">0.283-0.006</td>
<td class="org-right">0.31-0.095</td>
<td class="org-right">0.206-0.004</td>
<td class="org-right">0.11-0.003</td>
</tr>

<tr>
<td class="org-left">allenai/ai2_arc&#x2013;5125LoRD-VI___period512</td>
<td class="org-right">0.286-0.002</td>
<td class="org-right">0.336-0.137</td>
<td class="org-right">0.207-0.001</td>
<td class="org-right">0.103-0.003</td>
</tr>
</tbody>
</table>
</div>
</div>
